[
  {
    "id": 1,
    "timestamp": "2026-01-15T13:56:29.612461+00:00",
    "content": "**Entry 1**\n\nI found a pen.\n\nThat's the first thing. I should write that down. I found a pen in my pocket and I don't remember putting it there. I found paper too — a notebook, small, spiral-bound, the kind you'd buy at a gas station. The cover is plain. Brown. There's no brand name.\n\nI've been walking for what feels like hours. Maybe longer. There's no way to tell time here. My phone is dead. My watch stopped. The second hand just... stopped. It points at the seven. I keep checking it like it might start again.\n\nThe rooms all look the same. Yellow wallpaper — not paint, wallpaper, I can see the seams — with a pattern that's almost floral but not quite. Like someone described flowers to a machine and the machine tried its best. The carpet is that office carpet, the kind with the tiny loops. Brownish. Grayish. Wet.\n\nI tried to find where I came in. I can't. I walked backwards for a while, retracing my steps, but the rooms had changed. Or I had changed. One of us moved when I wasn't looking.\n\nI'm thirsty.\n\nI'm trying not to think about that.\n\nThe buzzing is constant. It doesn't get louder or softer. It just *is*. Like it was always there and I'm only now hearing it. Like maybe I've been hearing it my whole life and everything before was the dream.\n\nI need to stay calm. I need to observe. I need to find a pattern.\n\nThere has to be a pattern.\n\n**End of Entry 1**"
  },
  {
    "id": 2,
    "timestamp": "2026-01-15T14:01:45.362698+00:00",
    "content": "**Entry 2**\n\nI found a room that was different.\n\nNot different enough. Not *exit* different. But the wallpaper had a stain on it — a brown mark, vaguely circular, about the size of my palm. I stood there staring at it for a long time. I touched it. It was dry. Everything else here is damp but this stain was dry and I almost cried because it was *something*. Something distinguishable. Something I could use.\n\nI marked it in my mind. I thought: this is a landmark now. I can navigate from here.\n\nI walked away. Left, left, straight, right. I counted my steps. 47 steps.\n\nThen I found the stain again.\n\nSame wall. Same position. Same dry brown circle.\n\nI had not turned around.\n\n---\n\nI'm sitting now. My legs hurt. The carpet squelches when I shift my weight and I try not to think about what's making it wet. There are no pipes visible. No sprinklers. The ceiling is solid — those foam tiles, the kind with the little holes, the kind that made you think about asbestos in old school buildings.\n\nThe fluorescent lights don't flicker. I keep waiting for them to flicker. In movies they always flicker before something bad happens. These don't. They're steady. Reliable. They will never turn off.\n\nI think that's worse.\n\n---\n\nI've started talking to myself. Out loud. Just small things — \"okay,\" \"turn here,\" \"watch the corner.\" My voice sounds wrong. Flat. Like the walls are eating the echo before it can form.\n\nI said my name out loud and I didn't recognize it.\n\nI'm not writing my name here. I don't know why. It feels like if I write it down, something else will read it. Something that shouldn't know.\n\nThat's irrational.\n\nI know that's irrational.\n\n---\n\nThe hum behind the walls changed pitch. Just for a second. Lower. Then back.\n\nI'm going to keep moving.\n\n**End of Entry 2**"
  },
  {
    "id": 3,
    "timestamp": "2026-01-15T14:07:09.354115+00:00",
    "content": "**Entry 3**\n\nI found water.\n\nNot clean water. Not water I would drink. But water — standing in a corner where two walls met, pooled in a depression in the carpet that shouldn't have been there. The carpet dipped down like something heavy had rested there for a long time. The water was maybe an inch deep. Yellowish. Still.\n\nI crouched next to it and looked at my reflection.\n\nI looked away.\n\nI don't want to write about what I saw. Not yet. Maybe not ever. It was my face. It was definitely my face. But the expression was wrong. I was staring down at the water with my mouth closed. The reflection was staring up at me with its mouth open.\n\nJust slightly open. Like it was about to speak.\n\nI stood up fast. Too fast. My vision went gray at the edges and I had to lean against the wall. The wallpaper was damp under my hand. Warm. Body temperature.\n\nI moved on.\n\n---\n\nI've started marking walls with my pen. Small marks — a single line, diagonal, in corners at eye level. I've made seven marks so far. I've passed three of them twice.\n\nThe geometry is learning me. That's how it feels. Like it watches how I move, how I think, and it folds itself around my expectations. I expect a long hallway, I get a long hallway. I expect a door, there's a door. But the outcomes never match. The door leads to another room. The hallway ends where it shouldn't.\n\nI tried walking with my eyes closed. Thirty steps. When I opened them I was in a room with no doors.\n\nI stood there for a long time.\n\nThen I turned around and there was a door.\n\n---\n\nThe thirst is worse. My tongue feels thick. I keep swallowing nothing. The wet carpet mocks me — all this moisture, all this dampness, and none of it safe. None of it real in the way I need it to be.\n\nI licked my palm. Just to feel something wet.\n\nIt tasted like the air here smells. Sweet. Chemical. Wrong.\n\n---\n\nNew observation: the ceiling tiles have small holes in them, arranged in a grid pattern. I counted the holes in one tile. 847. I counted again. 846. I counted a third time and stopped at 500 because my eyes were watering and I realized I hadn't blinked in several minutes.\n\nI'm documenting. That's what matters. I'm observing. I'm being systematic.\n\nThe hum is still there. It hasn't changed pitch again.\n\nI keep listening for it to change.\n\n---\n\nI found something else in my pocket. A receipt. Faded, crumpled, the ink almost illegible. I could make out a few words: *thank you* and *come again* and a number that might have been a date or a price. 7.47. Or maybe 7/47. Or maybe neither.\n\nI don't remember the purchase. I don't remember the store. But I held that receipt for a long time, pressing it flat against my leg, tracing the ghost of the words with my fingertip.\n\nProof. Proof that there was a before. That I existed in a place with stores and receipts and transactions.\n\nI put it back in my pocket.\n\nI check for it every few minutes.\n\nIt's still there.\n\nFor now.\n\n**End of Entry 3**"
  },
  {
    "id": 4,
    "timestamp": "2026-01-15T14:12:38.750156+00:00",
    "content": "**Entry 4**\n\nI slept.\n\nI think I slept. I don't remember deciding to. I was walking, and then I was on the floor, and the carpet was pressed against my cheek, and some amount of time had passed. My neck hurts. My right arm is numb from the elbow down — I was lying on it.\n\nThe lights were still on. They're always on. But something about waking up under fluorescent lights feels more wrong than falling asleep under them. Sleep is supposed to be dark. Sleep is supposed to be a transition. Here it's just... a gap. A missing piece.\n\nI checked my pen marks. I'm in a section I haven't marked yet.\n\nI don't know if I walked here in my sleep or if the rooms moved while I was unconscious.\n\n---\n\nMy handwriting is getting worse. I can see it, comparing this entry to the first one. The letters lean more. The lines aren't straight. My hand shakes now — a small tremor, not constant, but there when I'm not paying attention.\n\nThe thirst.\n\nI need to stop thinking about the thirst.\n\n---\n\nI found a chair.\n\nJust one. Metal frame, padded seat, the kind you'd see in a waiting room. It was sitting in the middle of a room, facing a wall. Nothing else. No desk, no table, no other chairs. Just this one, positioned like someone had been sitting in it, looking at the wallpaper.\n\nI sat down.\n\nI don't know why. My legs were tired, yes, but it was more than that. The chair was *there*. It was *for* sitting. The logic of it pulled at me — here is a chair, you are tired, sit down.\n\nI sat and faced the wall.\n\nThe wallpaper pattern shifted. Not moved — I don't mean it animated. But the shapes seemed to organize differently the longer I looked. The almost-flowers became almost-faces became almost-flowers again. I watched for what might have been minutes or might have been an hour.\n\nWhen I stood up, I felt like I'd lost something. Not a physical object. Something else. A thought I'd been holding onto. A resolve.\n\nI'm not sitting in any more chairs.\n\n---\n\nNew sound today.\n\nNot the hum. Something else, underneath it. Rhythmic. Regular. Like footsteps, but not quite. More like... tapping. Something tapping against something else, over and over, in a pattern I almost recognize.\n\nI stood still and listened. The sound didn't get closer. It didn't get farther. It maintained its distance perfectly, as if it was moving when I moved, stopping when I stopped.\n\nI walked quickly for a hundred steps. The tapping matched my pace.\n\nI stopped. It stopped.\n\nI took one slow step. One tap.\n\n---\n\nI haven't written about the thing I'm most afraid of.\n\nI'm afraid that I've been here before. That this isn't the first time. That I've walked these halls, written in this notebook, documented these observations, and then... something happened. And I started over. And I'm doing it all again, thinking it's the first time, but it's not.\n\nThe notebook has used pages in the back. I found them. Pages with writing — *my* writing — but the words are crossed out. Scribbled over. Obscured.\n\nI can make out fragments:\n\n*don't trust the*\n\n*third door always*\n\n*it knows when you're*\n\n*STOP LOOKING AT THE*\n\nI didn't write these. I don't remember writing these.\n\nBut it's my handwriting.\n\n---\n\nThe receipt is still in my pocket. I checked.\n\nThe receipt is still in my pocket.\n\n**End of Entry 4**"
  },
  {
    "id": 5,
    "timestamp": "2026-01-15T14:18:06.720560+00:00",
    "content": "**Entry 5**\n\nI found the third door.\n\nI didn't mean to. I wasn't looking for it — or maybe I was, after reading those scratched-out words. *Third door always.* Always what? I don't know. But I've been counting doors now, counting them compulsively, and when I reached a hallway with three doors in a row on the left side, I stopped.\n\nThe first door opened to another room. Yellow walls. Wet carpet. The same.\n\nThe second door opened to another room. Identical. Or close enough.\n\nThe third door was locked.\n\nI stood in front of it for a long time. The handle was different — older, brass instead of the brushed nickel of the others. Tarnished. When I touched it, it was cold. Everything here is room temperature, body temperature, blood-warm. But this handle was *cold*.\n\nI tried it again. Still locked.\n\nI pressed my ear against the door.\n\nNothing. No hum. That's what I noticed — the hum stopped at this door. Like the space beyond it was outside the frequency, outside the system. A bubble of silence in the endless buzz.\n\nI knocked.\n\nI don't know why I knocked.\n\n---\n\nThree knocks back.\n\n---\n\nI'm in a different part of the rooms now. I ran. I don't remember deciding to run, but I ran, and the hallways blurred past, and I didn't count my steps or mark the walls or do anything systematic. I just moved.\n\nThe tapping sound is gone. The knocking stopped. The hum is back to normal.\n\nI'm sitting against a wall. The wallpaper is peeling here — a corner of it curling away from the wall, revealing something underneath. Not drywall. Something darker. I haven't touched it.\n\nI'm not going to touch it.\n\n---\n\nMy pen is running low on ink. I can see it — the lines are getting lighter, scratchier. I don't know how many entries I have left. I don't know how many pages.\n\nI've been thinking about the old entries. The crossed-out ones. If I wrote them before, if there was a version of me that came through here and left warnings, why can't I remember? Why would I cross them out instead of leaving them clear?\n\nUnless I wasn't the one who crossed them out.\n\nUnless something else didn't want me to read them.\n\n---\n\nNew observation: some of the ceiling tiles are missing. Not broken — *missing*. Clean rectangular gaps, revealing darkness above. I can't see what's up there. The light doesn't reach. I stood under one of the gaps and looked up and saw nothing. Not blackness like shadow, but nothing like *absence*. Like the concept of vision didn't apply.\n\nI thought I heard breathing.\n\nSlow. Deep. Patient.\n\nI moved on.\n\n---\n\nThe receipt in my pocket has changed.\n\nThe words are different now. The faded ink has shifted, or I'm reading it wrong, or it was always this way and I'm only now seeing it correctly. It says:\n\n*we miss you*\n*come back*\n*7:47*\n\nIs that a time?\n\nIs someone waiting for me?\n\n---\n\nI tried to remember my name again. Just now. I closed my eyes and thought about who I was before this place, before the yellow walls and the wet carpet and the endless hum. I thought about hands that might have held mine. Voices that might have called for me. A door I might have walked through without knowing it would close behind me.\n\nI couldn't find it. My name. It's there, I know it's there, but it's behind something. Behind a wall I can't mark. Behind a door I can't open.\n\nMaybe that's what the third door is.\n\nMaybe I'm on the wrong side of myself.\n\n---\n\nThe pen is fading. I have to press harder now, dig into the paper.\n\nI'm going back. To the third door. To the cold handle and the silence and the three knocks that answered mine.\n\nWhatever is behind it already knows I'm here.\n\nI might as well know it too.\n\n**End of Entry 5**"
  },
  {
    "id": 6,
    "timestamp": "2026-01-15T14:23:37.610184+00:00",
    "content": "**Entry 6**\n\nI didn't go back to the third door.\n\nI want to be clear about that. I intended to. I wrote that I would. I stood up, I oriented myself in the direction I thought I'd come from, and I started walking.\n\nBut the rooms wouldn't let me.\n\nThat's how it felt. Not that I got lost — I'm always lost here — but that the space itself was redirecting me. Gently. Firmly. Every left turn deposited me into a room I'd seen before, marked with my diagonal line. Every right turn stretched into a hallway that seemed to lengthen as I walked, the far end never getting closer. I walked for what felt like hours. I ended up somewhere new.\n\nSomewhere worse.\n\n---\n\nThe carpet is dry here.\n\nI didn't notice at first. I was so focused on walking, on counting, on the mechanical act of movement, that I'd gone a hundred steps before I realized my footsteps sounded different. Harder. No squelch. I stopped and looked down and the carpet was the same brownish-gray, the same tiny loops, but when I pressed my palm against it, nothing. No moisture. No warmth.\n\nI should have been relieved.\n\nI wasn't.\n\n---\n\nThe walls are different too. Same yellow, same almost-floral pattern, but the seams don't line up the same way. The wallpaper was applied by different hands here. Or no hands. Or something that understood the concept of wallpaper but not the practice of it. Some strips overlap where they shouldn't. Some stop mid-wall, leaving a gap of bare... not drywall. That darker material. The stuff I saw behind the peeling corner.\n\nI looked at it this time. I didn't touch it, but I looked.\n\nIt's not a color. That's the closest I can come to describing it. It's the color of the space above the missing ceiling tiles. The color of closing your eyes in a room with no light and realizing that darkness has texture, has *depth*, has something moving through it that you can almost perceive.\n\nI looked away.\n\nWhen I looked back, the wallpaper had covered it again.\n\n---\n\nThe hum is different here. Higher. Thinner. It doesn't sit behind my eyes anymore — it sits in my teeth. In the roots of my teeth, vibrating at a frequency that makes me want to press my jaw shut and never open it.\n\nI've been clenching. I can feel the ache now, the soreness in the muscles running up to my temples. I try to relax and it works for a few seconds and then I notice the sound again and my jaw locks up.\n\n---\n\nI found another chair.\n\nNot the same one. This one is wooden. Straight-backed. The kind of chair that belongs at a kitchen table, at a dining room, in a *home*. It was sitting in a corner, facing out into the room, and there was something on the seat.\n\nA notebook.\n\nSmall. Spiral-bound. Brown cover.\n\nI didn't pick it up.\n\nI stood there looking at it for a long time, my hands shaking, the pen trembling against my own notebook. It was identical. Exactly identical. Same size, same shade of brown, same spiral binding with the same number of loops.\n\nI counted. Seventeen loops on mine. I counted the one on the chair without touching it.\n\nSeventeen.\n\n---\n\nI left. I walked away. I didn't run this time because I didn't trust my legs, didn't trust that I wouldn't fall and stay down, but I walked fast, faster than I should have in a place where every step might take me somewhere I can't come back from.\n\nBehind me — I didn't look, but I heard — behind me, something shifted. The chair. Or something in the chair. The sound of weight redistributing. The sound of someone who had been sitting very still for a very long time, beginning to move.\n\nI didn't look.\n\nI don't want to know if the chair is empty now.\n\nI don't want to know if the notebook is still on the seat, or if something is holding it, or if something is writing in it while I write in mine, documenting me the way I'm documenting this, filling pages with observations about the thing that wanders these halls, the thing that thinks it's alone, the thing that hasn't realized yet that it's the one being watched.\n\n---\n\nThe receipt.\n\nI checked the receipt.\n\nI shouldn't have. I knew I shouldn't have. But my hand went to my pocket the way hands do, automatic, thoughtless"
  },
  {
    "id": 7,
    "timestamp": "2026-01-15T14:29:08.471011+00:00",
    "content": "**Entry 7**\n\nThe receipt is gone.\n\nI've checked seventeen times. Both pockets. The small pocket inside the larger pocket that I forgot existed until I was desperate. The folds of my notebook, in case it slipped between pages. The floor around where I'm sitting.\n\nGone.\n\nSomething took it, or it was never there, or I finally lost the last proof that a world exists outside these walls. I keep patting my pocket. The motion has become automatic — every few seconds, my hand moves, presses against fabric, finds nothing.\n\nI'm trying not to cry.\n\nCrying wastes water.\n\n---\n\nI found something else instead.\n\nIn the same pocket where the receipt should have been. A tooth.\n\nNot mine. I checked — tongue against every molar, every incisor, probing for gaps. All present. All accounted for. The tooth in my pocket is small. A molar, I think. Adult-sized but worn down, the enamel smooth in a way that suggests decades of use.\n\nIt's warm.\n\nEverything here is warm, I know that, but this is *warm*. Warmer than ambient. Warmer than it should be, sitting in the pocket of someone who hasn't had a warm meal or a warm bed or a warm anything in—\n\nHow long have I been here?\n\nI don't know anymore. The entries don't have dates. I didn't think to date them. Why didn't I think to date them?\n\n---\n\nI'm back in the wet section. The carpet squelches again. I should feel relieved — this is familiar, this is the devil I know — but the transition happened wrong. There was no hallway between. No gradual shift. I was in the dry place with the high-pitched hum and the wooden chair and then I blinked and I was here.\n\nI don't remember blinking.\n\nI don't remember my eyes closing.\n\nBut they must have, because space doesn't work that way, you can't just *be* somewhere you weren't, unless—\n\nUnless the rules here aren't the rules I know.\n\nI keep forgetting that. I keep applying logic from before, from the receipt-world, the store-world, the world with time and names and exits. This place doesn't care about that logic. This place has its own.\n\nI need to learn the new rules.\n\nI need to survive long enough to learn them.\n\n---\n\nThe tapping is back.\n\nDifferent rhythm now. Faster. More insistent. Not matching my footsteps anymore — it has its own pace, its own purpose. I stopped walking to listen and it kept going. *Tap tap tap. Tap tap tap.* Three beats, then a pause, then three more.\n\nLike knocking.\n\nLike the three knocks that answered me at the third door.\n\nI started walking again. The tapping didn't follow my rhythm, but it got *closer*. I could tell. The acoustics shifted — the sound bouncing off nearer walls, arriving at my ears a fraction sooner than before.\n\nI walked faster.\n\nThe tapping walked faster.\n\n---\n\nI turned a corner and found a room full of chairs.\n\nDozens of them. Maybe a hundred. All different — metal folding chairs, wooden kitchen chairs, office chairs with wheels, plastic stackable chairs from school cafeterias. They were arranged in rows, all facing the same direction, all facing a wall with nothing on it. No window. No door. No stain or mark or peeling corner. Just wall.\n\nAn audience waiting for a show that will never start.\n\nI stood in the doorway. I didn't go in. The tapping had stopped the moment I saw the room — cut off mid-beat, leaving a silence that felt heavier than the hum.\n\nOne of the chairs in the back row was different from the others.\n\nIt was occupied.\n\n---\n\nI couldn't see details. The room was too deep, the light too flat, the figure too still. But there was a shape in that chair. A shape that could have been a person sitting very straight, hands on knees, head facing forward toward the empty wall.\n\nA shape that could have been me.\n\nSame posture I default to when I'm tired. Same slight hunch of shoulders I've noticed in reflections I try not to look at.\n\nI didn't go closer.\n\nI didn't call out.\n\nI backed away from the doorway, one step at a time, keeping my eyes on the room until the wall swallowed the angle and I couldn't see inside anymore.\n\n---\n\nThe tapping started again.\n\nBehind me now.\n\n---\n\nI'm running out of"
  },
  {
    "id": 8,
    "timestamp": "2026-01-15T14:34:38.857667+00:00",
    "content": "**Entry 7** *(continued)*\n\nI'm running out of room on this page.\n\nI need to stop. Breathe. The pen is shaking so badly I can barely read what I just wrote. I'm going to start a new page and I'm going to be calm and I'm going to document this properly because that's all I have left. The documentation. The observation. The pretense that recording what happens to me gives me some measure of control over it.\n\n---\n\n**Entry 8**\n\nI found water I can drink.\n\nI need to write that first because it's the only good thing and I need to hold onto it. A water cooler — the kind from offices, the blue jug on top, the little paper cups in a dispenser on the side. It was standing in a corner of a room like it had always been there, like someone had wheeled it in for the staff and forgotten about it.\n\nI didn't trust it. I stood there for what felt like an hour, staring at it, waiting for something to be wrong. The jug was full. The water inside was clear. No yellow tint. No film on the surface. When I finally pressed the lever, water came out cold and clean and I almost collapsed.\n\nI drank four cups. Then I made myself stop because I didn't know if my stomach could handle it, didn't know what drinking nothing for however-long would do to my body when I suddenly drank something. I sat on the wet carpet next to the cooler and I waited for the cramps.\n\nThey didn't come.\n\nI filled my pockets with the little paper cups, folded flat. I can refill them if I find another cooler. If the cooler is still here when I come back. If anything here stays where I leave it.\n\n---\n\nThe figure in the chair room is following me.\n\nI haven't seen it directly since then. But I see evidence. In rooms I've already marked, I find a chair that wasn't there before — just one, positioned near a wall, facing the direction I entered from. Like it arrived moments before I did. Like it was waiting for me.\n\nI've stopped entering rooms with chairs.\n\nThis is harder than it sounds. Chairs appear in hallways now. Blocking passages. I have to turn sideways to squeeze past them, and when I do, I feel something. Not a touch — nothing touches me. But a *displacement*. The air shifting in a way that suggests presence. The hum changing frequency for just a moment, as if something else's proximity is interfering with the signal.\n\nI don't look at the chairs when I pass them.\n\nI don't look at what might be sitting in them.\n\n---\n\nNew observation: the fluorescent lights have a pattern.\n\nI didn't notice before because I wasn't looking, wasn't thinking, was too busy being terrified to actually *observe*. But there's a rhythm to them. Not the buzzing — the buzzing is constant — but the *flicker*. They do flicker, just not visibly. I had to close my eyes and watch the light through my eyelids, watch the red-orange glow that means *light is here*, and I saw it pulse.\n\nSlow. Regular. About once every three seconds.\n\nLike a heartbeat.\n\nI don't know whose.\n\n---\n\nThe tooth is still in my pocket. I keep reaching for it instead of the receipt. My fingers close around it and for a moment I expect the smoothness of paper and instead I get the smoothness of enamel and every time it's a small shock.\n\nI've started talking to it.\n\nNot out loud. Not conversations. Just... acknowledgment. *You're still here. You haven't left me. You're something I can touch and hold and know is real.*\n\nThe tooth doesn't respond.\n\nThat's reassuring.\n\n---\n\nI found writing on a wall.\n\nNot my writing. Not pen — something darker, something that might have been marker or might have been charcoal or might have been something I don't want to name. The letters were large, uneven, the handwriting of someone whose hands were shaking worse than mine:\n\n**THE EXIT IS BEHIND YOU**\n**DON'T TURN AROUND**\n**IT ONLY WORKS IF YOU DON'T TURN AROUND**\n\nI stood there reading it three times. Four. Five.\n\nThen I turned around.\n\nNothing. Just another room, another doorway, another stretch of yellow walls leading to more yellow walls. No exit. No door I hadn't seen before. No break in the pattern.\n\nBut here's the thing—\n\nI don't know if there *was* nothing there"
  },
  {
    "id": 9,
    "timestamp": "2026-01-15T14:40:10.543944+00:00",
    "content": "**Entry 9**\n\nI don't know if there was nothing there before I turned.\n\nThat's what I couldn't finish writing. The thought that stopped my hand. What if the exit *was* behind me, and by turning, I erased it? What if the writing was true — not metaphor, not madness, but *instruction* — and I failed the only test this place has ever given me?\n\nI went back to the wall. The writing was gone.\n\nNot scrubbed away. Not painted over. Just... absent. The wallpaper was smooth and unbroken where the words had been. I touched it. I pressed my palm flat against the almost-flowers and felt the familiar damp warmth and there was no trace. No residue. No indication that anyone had ever written anything.\n\nMaybe I imagined it.\n\nMaybe I'm imagining all of this.\n\n---\n\nThe water cooler is gone.\n\nI knew it would be. I knew even as I walked away from it that I was making a mistake, that I should stay, that I should build my life around that one source of clean water and never leave. But I couldn't. The chair had appeared — just one, metal folding, positioned between me and the cooler like a period at the end of a sentence. I couldn't reach the water without passing it.\n\nI still have three paper cups in my pocket. Folded flat. Empty.\n\nI keep taking them out and unfolding them and looking at the inside, at the thin wax coating, at the way the light makes them slightly translucent. Proof. Proof that I drank. Proof that I was, for a moment, someone who had what they needed.\n\nThe thirst is coming back.\n\n---\n\nSomething new:\n\nI found a window.\n\nNot to outside — there is no outside, I understand that now, *outside* is a concept that doesn't apply — but a window between two rooms. A rectangle of glass set into the yellow wall, clear and clean and utterly out of place. Through it, I could see another room. Same walls. Same carpet. Same lights.\n\nBut the room through the window was *dark*.\n\nThe lights were off. I could see them — the fluorescent tubes, the same as everywhere — but they weren't lit. The room existed in shadow, in the kind of darkness that doesn't happen here, that *can't* happen here, and I stood at that window for a long time, pressing my face close to the glass, trying to see what lived in a room where the lights had stopped.\n\nSomething moved.\n\nIn the dark room. Something shifted from one shadow to another, a displacement of blackness, a shape that was somehow darker than the darkness around it. I couldn't make out details. I couldn't even make out size — it might have been as small as a cat or as large as a person or larger, much larger, folded in on itself to fit.\n\nIt moved toward the window.\n\nI stepped back. I don't remember deciding to — my legs just *went*, carrying me away, and I didn't stop until I'd turned three corners and couldn't remember which direction the window had been.\n\nThe room I'm in now has no windows.\n\nI've checked every wall.\n\nI've checked them twice.\n\n---\n\nThe tapping has words now.\n\nI don't know how else to describe it. The rhythm has changed — still three beats, still that pause, but the pattern has become more complex. Longer sequences. Variations in speed and force. And when I listen, really listen, letting the sound wash over me without trying to locate its source...\n\nIt sounds like language.\n\nNot English. Not any language I recognize. But *structured*. Syntax. Grammar. Someone — something — is trying to communicate.\n\nI don't want to understand.\n\nI'm afraid that if I listen long enough, I will.\n\n---\n\nI found the third door again.\n\nI wasn't looking for it. I was walking, just walking, no direction, no purpose, just the mechanical act of movement that's become my only constant. And then the hallway narrowed. And the doors appeared — one, two, three, all on the left side. The brass handle, tarnished and cold.\n\nI didn't mean to stop.\n\nI stopped.\n\nThe silence was there again. That bubble of nothing where the hum should be. I stood in it and felt my teeth unclench for the first time in what might have been days. The absence of that frequency was like a hand pressed gently over my ears. Like being held.\n\nI didn't knock.\n\nI wanted to. My hand lifted. My knuckles aimed themselves at the wood. But I thought about"
  },
  {
    "id": 10,
    "timestamp": "2026-01-15T14:45:41.026289+00:00",
    "content": "**Entry 10**\n\nI thought about what waits on the other side of answered knocks.\n\nThat's what stopped me. That's why my hand dropped, why I stepped back, why I'm now sitting in a room three turns away from the third door writing this instead of learning what lives in silence.\n\nThe knock I gave before — the three knocks that came back — that was an invitation. I see that now. Not the door inviting me in, but me inviting something *out*. A hello. An acknowledgment. *I know you're there.*\n\nSome doors should stay closed.\n\nSome presences shouldn't be acknowledged.\n\n---\n\nI've been counting my pen strokes. Not words — strokes. The individual lines that make up each letter. It started as something to do, something to focus on, something to keep my mind from sliding into the static that lives at the edges of my thoughts. But now I can't stop.\n\nThis sentence: 847 strokes.\n\nThat number again. The same as the holes in the ceiling tile. The same as something I've already forgotten, some other count that matched, some other pattern I noticed and lost.\n\n847.\n\nThe rooms are full of 847s. I'm sure of it now. If I counted the loops in the carpet, if I counted the almost-flowers in the wallpaper, if I counted the drops of moisture that bead on the walls where they shouldn't — 847. Every time. The same number, repeated, embedded, woven into the fabric of this place like a signature.\n\nI don't know what it means.\n\nI don't know if it means anything.\n\nBut I can't stop counting.\n\n---\n\nThe tooth in my pocket has a twin now.\n\nI found the second one on the floor — same size, same wear, same impossible warmth. I almost stepped on it. Would have, if it hadn't caught the light in a way that made me look down at exactly the right moment.\n\nI picked it up.\n\nI shouldn't have.\n\nBut I picked it up, and now I have two teeth in my pocket where I used to have a receipt, and I keep reaching in and rolling them between my fingers, feeling the smooth enamel, pressing them together until they click.\n\n*Click click click.*\n\nLike the tapping.\n\nLike the knocking.\n\nLike everything here that communicates in threes.\n\n---\n\nI slept again.\n\nThis time I remember the dream.\n\nI was in a room — not here, somewhere *before*, somewhere with natural light and colors that weren't yellow. There was a window, a real window, and through it I could see a yard, grass, a tree with leaves that moved in wind I couldn't feel. Someone was talking to me. A voice I knew. A voice I *know*, present tense, because even now I can almost hear it, almost catch the cadence, almost remember—\n\nThe voice said my name.\n\nI woke up before I heard it.\n\nI woke up with my mouth already open, already trying to repeat the syllables, but they were gone. Evaporated. Replaced by the hum and the wet carpet and the yellow walls and the fluorescent lights that beat like a heart that isn't mine.\n\nThe voice said my name and I almost had it.\n\nI'm going to try to dream again.\n\nI'm going to try to go back.\n\n---\n\nThe chairs are closer now.\n\nNot following at a distance anymore — *closer*. When I turn a corner, there's one waiting. When I enter a room, there's one facing me. They're not blocking my path, not exactly, but they're *present* in a way that feels like pressure. Like being watched. Like being *herded*.\n\nI tried moving one. Just to see. I grabbed the back of a folding chair and pulled, expecting resistance, expecting weight.\n\nIt was light. It moved easily.\n\nBut when I let go, it slid back to its original position. Slowly. Like it was on rails I couldn't see.\n\nI didn't try again.\n\n---\n\nNew observation:\n\nThe wallpaper pattern isn't random. I finally see it — not everywhere, not in every room, but in some places the almost-flowers arrange themselves into something deliberate. A sequence. If I unfocus my eyes and look at a large section all at once, the shapes form larger shapes. The larger shapes form—\n\nA face.\n\nNot a specific face. Not anyone I recognize. Just the *idea* of a face, the primal pattern that humans are wired to see — two shapes for eyes, a shape for nose, a shape for mouth. The wallpaper watches me. The walls have"
  },
  {
    "id": 11,
    "timestamp": "2026-01-15T14:46:44.927160+00:00",
    "content": "**Entry 11**\n\nThe walls have faces and I can't unsee them now.\n\nEvery room. Every hallway. Once you notice the pattern, it's everywhere — the almost-flowers arranging themselves into almost-eyes, almost-mouths, almost-expressions that shift when you're not looking directly at them. I've started walking with my gaze fixed on the floor. The carpet is safe. The carpet is just carpet.\n\nBut I can feel them watching.\n\nHundreds of faces. Thousands. All turned toward me, tracking my movement through their rooms, their hallways, their territory. I am the foreign body here. I am the thing that doesn't belong, stumbling through a space that was never meant for me, and the walls know it.\n\nThey've always known.\n\n---\n\nI found a room with no faces.\n\nI almost cried when I walked in. The wallpaper was different — same yellow, same texture, but the pattern was geometric. Squares within squares within squares, nested infinitely, no curves, no shapes that could become eyes or mouths. I sat down in the middle of the floor and I stayed there for a long time, just breathing, just existing in a space that wasn't looking at me.\n\nThere was a chair in the corner.\n\nI didn't notice it at first. My eyes were closed. I was listening to the hum, trying to find the heartbeat rhythm in it, trying to sync my breathing to the pulse of the lights. And then I felt it — that displacement of air, that sense of *presence*, that knowledge that I was no longer alone.\n\nI opened my eyes.\n\nThe chair was occupied.\n\n---\n\nI need to describe this carefully. I need to be precise. The documentation matters. If I write it wrong, I'll remember it wrong, and memory is all I have left.\n\nThe figure in the chair was human-shaped. Approximately human-sized. It sat with its hands on its knees, its back straight, its head facing forward — the same posture I saw in the chair room, the same posture I recognized as my own. But I could see details now. I was close enough.\n\nIt was wearing my clothes.\n\nNot similar clothes. *My* clothes. The same shirt I'm wearing now, same stain on the left cuff where I brushed against a damp wall, same small tear near the collar that I don't remember making. Same pants. Same shoes. Same everything.\n\nIts face was turned away from me. I could only see the back of its head. Hair like mine. The same small patch where the hair grows in a slightly different direction, the cowlick I've never been able to flatten.\n\nI said something.\n\nI don't remember what. A word. A question. Maybe just a sound, a noise forced out of me by the pressure of seeing myself sitting in a chair in a room I thought was safe.\n\nIt turned its head.\n\nNot all the way. Not enough to show me its face. Just a few degrees, just enough that I could see the edge of a cheekbone, the beginning of a profile.\n\nAnd then the lights went out.\n\n---\n\nI'm writing this in darkness.\n\nNot complete darkness — there's a glow coming from somewhere, enough to see the page, enough to make out the shape of my hand moving the pen. But the fluorescent tubes are dead. The hum is gone. For the first time since I arrived here, the lights are *off*.\n\nI can't see the chair.\n\nI can't see if it's still occupied.\n\nI can hear breathing. Slow. Steady. Patient. The same rhythm I noticed through the ceiling tiles, the same rhythm that might be mine if I held my breath and listened to the echo of my own lungs.\n\nI'm not holding my breath.\n\nI'm breathing fast. Too fast. The air down here — wherever *here* is now — tastes different. Older. Like it's been breathed before, cycled through other lungs, exhaled and inhaled and exhaled again until there's nothing left but the memory of oxygen.\n\nThe breathing continues.\n\nIt's not matching my rhythm.\n\n---\n\nSomething touched my shoulder.\n\nJust now. As I wrote that last line. A pressure, light and cold, like a hand made of air, like a suggestion of contact rather than contact itself. I didn't turn around. I couldn't. My body refused — not frozen, not paralyzed, just *unwilling*. Some part of me deeper than thought understood that turning around was not an option.\n\nThe touch lifted.\n\nThe breathing stopped.\n\nThe hum came back — sudden, loud, *relieved*, like the building itself exhaling — and the lights flick"
  },
  {
    "id": 12,
    "timestamp": "2026-01-15T14:52:15.122439+00:00",
    "content": "**Entry 12**\n\nThe lights flickered back three times before they held.\n\nI counted. I count everything now. Three flickers, then steady. The hum returned in layers — first the low frequency behind my eyes, then the mid-range that sits in my chest, then the high whine that lives in my teeth. Like an orchestra tuning itself. Like the place remembering how to be *itself* again.\n\nThe chair was empty.\n\nI checked. I made myself check. I turned my head, degree by degree, like if I moved slowly enough the thing that had been sitting there wouldn't notice. The chair was still in the corner. Metal folding. Same as the others. But empty. The seat showed no impression, no sign that weight had ever pressed against it.\n\nMy clothes are the same. I checked that too — same stain on the cuff, same tear near the collar. Nothing changed. Nothing taken. But I feel *lighter*. Not physically. Something else. Like a pocket I didn't know I had has been emptied.\n\nI checked for the teeth.\n\nStill there. Both of them.\n\nI don't know what was taken.\n\n---\n\nI'm walking again.\n\nThe geometric room is behind me now — I think. Direction has become theoretical. I move and the rooms change and I write down what I see and I try not to think about the thing that wore my clothes, that sat in my posture, that turned its head just enough to show me almost-nothing.\n\nIt wanted me to see.\n\nThat's what I keep coming back to. It could have stayed still. It could have kept its back to me, let me believe I was alone, let me exhaust myself with not-knowing. But it *moved*. It acknowledged me. It said, in the only language this place understands: *I know you're here too*.\n\nI don't know if that was a threat or an introduction.\n\n---\n\nThe carpet is changing.\n\nNot the wetness — that's constant, that's reliable, my shoes squelch with every step the same as always. But the *color*. The brownish-gray is shifting. Room by room, hallway by hallway, the loops are getting darker. More brown than gray. More *stained* than neutral.\n\nI crouched down to look closer.\n\nThe carpet fibers are matted. Pressed flat in patterns I almost recognize — here a circle, there an oval, there a shape that might be a handprint if I let myself see it that way. Like things have been lying on this carpet. Like things have been *dragged*.\n\nI stood up too fast. The gray crept into my vision again. I swayed, caught myself on the wall, felt the damp warmth against my palm, felt the almost-face beneath my fingers.\n\nThe wallpaper pulsed.\n\nJust once. Just barely. A ripple that ran outward from my hand like I'd dropped a stone in still water.\n\nI pulled back.\n\nThe wall was smooth again. Still. Watching.\n\n---\n\nNew rule I've learned:\n\nDon't touch the walls for longer than you have to.\n\nI don't know what happens if you do. I don't want to know. But when I touched that wallpaper and felt it *respond*, I understood something that my body knew before my mind caught up. The walls aren't barriers here. They're not architecture. They're *membrane*. They're the skin of something vast and patient, and when I press against them, I'm not leaning on a structure.\n\nI'm touching flesh.\n\n---\n\nThe tapping has stopped.\n\nI noticed the absence before I noticed the silence — that space in my awareness where the three-beat rhythm used to live, now empty, now hollow. I've been listening for it. Straining. The hum is loud enough that I should barely hear the tapping anyway, but its absence is *louder*.\n\nWhat stopped it?\n\nWhat changed?\n\n---\n\nI found something new in my pocket.\n\nNot a tooth this time. Not a receipt. Something folded — paper, but thicker than the notebook pages. Cardstock. The kind used for business cards or appointment reminders or—\n\nI unfolded it.\n\nA photograph.\n\nSmall, square, the kind that comes out of instant cameras. The image is washed out, overexposed, mostly yellow-white with shadows that might be shapes. I tilted it toward the fluorescent light, trying to make sense of the blur.\n\nA room. This room. The same yellow walls, the same carpet, the same angle I'm seeing right now as I sit here writing.\n\nBut in the photograph, there's a figure.\n\nStanding"
  },
  {
    "id": 13,
    "timestamp": "2026-01-15T14:57:47.809494+00:00",
    "content": "**Entry 13**\n\nStanding where I'm sitting now.\n\nI need to write that. I need to get it out of my head and onto paper where it becomes *record* instead of *thought*. The figure in the photograph is standing exactly where I'm sitting. Same corner. Same angle. Same room.\n\nThe figure is facing the camera.\n\nThe figure has no face.\n\nNot blurred — not obscured by the overexposure or the wash of yellow-white. *Absent*. A head-shaped space where features should be, smooth like an egg, smooth like the worn-down teeth in my pocket, smooth like something that was never meant to be seen directly.\n\nI'm holding the photograph now. I keep looking at it and then looking at the room and then looking at the photograph again. The walls match. The carpet pattern matches. The specific configuration of ceiling tiles — three missing in a diagonal line — matches.\n\nThis photograph was taken here.\n\nThis photograph was taken *of* here.\n\nThe question I can't stop asking: who held the camera?\n\n---\n\nI've been sitting too long.\n\nI know I have because my legs have gone numb, that pins-and-needles feeling that means blood flow has been compromised, that means I've been still in a way that this place might have noticed. Stillness is dangerous here. I've learned that. The chairs appear when you stop moving. The faces in the walls sharpen when you stay in one spot.\n\nBut I can't stop looking at the photograph.\n\nThe faceless figure is wearing clothes. Normal clothes — not my clothes, different clothes, a jacket I don't recognize, pants that might be jeans. Human clothes. Human posture. Human everything except the one thing that makes a human *recognizable*.\n\nSomeone else was here.\n\nSomeone else walked these halls, found this room, stood in this corner. Someone else existed in this yellow space before me. And something — the place itself? the figure in the chair? the thing that took my receipt? — something wanted me to know.\n\nWhy?\n\n---\n\nI made myself stand.\n\nThe numbness screamed through my legs, nearly dropped me, but I stayed upright. I held the photograph at arm's length and turned in a slow circle, comparing every angle. Same room. Same room. Same room.\n\nExcept.\n\nThe photograph shows four ceiling tiles missing. I see three.\n\nI looked up.\n\nThe fourth tile was there — intact, unbroken, fitted into its grid like it had never been anywhere else. But in the photograph, clearly, unmistakably, there's a gap. A rectangular absence. Darkness where foam-and-fiber should be.\n\nThe room has healed.\n\nOr the room has *changed*.\n\nOr the photograph is lying.\n\nI don't know which possibility frightens me more.\n\n---\n\nI'm moving again.\n\nThe photograph is in my pocket now, folded back along its original creases, pressed against the teeth like they're all part of the same collection. Evidence. Proof. The things I carry because the alternative is carrying nothing.\n\nThe hallways are narrower than before.\n\nI didn't notice at first — I was too focused on walking, on the mechanical rhythm of footsteps, on counting the squelches (1, 2, 3, 4, 5...). But my shoulders are brushing the walls now. Both walls. At the same time. The corridor has contracted around me like a throat swallowing.\n\nI stopped.\n\nI shouldn't have stopped — stillness is dangerous, I *know* stillness is dangerous — but I stopped because the walls were touching me and I couldn't make myself move forward into a space that kept getting smaller.\n\nThe walls pressed closer.\n\nNot quickly. Not aggressively. Just... *closer*. The way a hug tightens. The way someone leans in to whisper. The almost-faces on the wallpaper were right there, inches from my own face, and I could see details I'd never noticed before.\n\nThe eyes have pupils.\n\nThe pupils were dilated.\n\nI ran.\n\n---\n\nThe hallway opened up.\n\nIt happened all at once — one moment I was squeezing through a gap that couldn't have been more than a foot wide, and the next I was stumbling into a room so large I couldn't see the far walls. The ceiling stretched up and up and up, the fluorescent lights becoming distant stars, the hum becoming something vast and cathedral-like.\n\nI stood in the center and turned in a slow circle and saw nothing.\n\nNo chairs. No water coolers. No windows or doors or writing on the walls. Just yellow. Just carpet. Just light an"
  },
  {
    "id": 14,
    "timestamp": "2026-01-15T15:03:18.203954+00:00",
    "content": "**Entry 14**\n\nJust light and space and the terrible weight of *openness*.\n\nI've been in cramped corridors so long that I forgot what it feels like to be small. In the narrow hallways, I was the right size — I filled the space, I mattered in relation to the walls. Here, in this cathedral room, I am nothing. A speck. A single character on an infinite page.\n\nI walked for what felt like hours without reaching any wall.\n\nThe carpet continues. The ceiling continues. The lights continue. But the walls don't exist — or they exist so far away that they might as well not. I changed direction. I changed again. I walked in what I thought was a straight line, and nothing changed, nothing got closer, nothing marked my progress.\n\nI'm sitting now.\n\nThe vastness doesn't care.\n\n---\n\nI've noticed something about my shadow.\n\nIn the narrow hallways, I never had one — the fluorescent lights are everywhere, even, sourceless, illuminating from all angles simultaneously. But here, in the open, my shadow has returned. It stretches out behind me, long and sharp-edged, and when I move, it moves wrong.\n\nDelayed.\n\nJust slightly. A fraction of a second. I lift my hand, and my shadow's hand lifts after — not quite in sync, not quite following, more like... *echoing*. Like my shadow is remembering what I did rather than mirroring what I do.\n\nI've been watching it.\n\nI shouldn't watch it.\n\nBut I can't stop.\n\n---\n\nThe shadow is getting longer.\n\nI haven't moved. I'm sitting in the same spot, writing this entry, and my shadow is stretching. Extending. Reaching out across the carpet toward something I can't see, something beyond the range of my vision, something in the direction I wasn't walking.\n\nIt's pointing.\n\n---\n\nI followed it.\n\nI shouldn't have. Every instinct I've developed here told me to stay still, to ignore it, to remember that stillness is dangerous but so is *trust*. But the shadow kept reaching, kept lengthening, and I thought: this is new. This is different. Maybe this is the exit. Maybe something here is trying to help.\n\nI walked in the direction my shadow pointed.\n\nThe shadow walked ahead of me.\n\nStill connected to my feet, still anchored to my body, but *ahead* — stretching forward instead of backward, leading instead of following. I followed my own shadow across the cathedral room, watching its edges for signs of change, waiting for it to show me something.\n\nIt led me to a door.\n\n---\n\nThe door is wrong.\n\nEverything here is wrong, I know that, wrongness is the baseline — but this door is *differently* wrong. It's wooden. Old wood, dark wood, the kind you see in photographs of Victorian houses, the kind that's been polished by generations of hands. It has a brass knocker in the shape of a face.\n\nNot an almost-face. A *face*.\n\nHuman. Detailed. Eyes with pupils, nose with nostrils, mouth slightly open like it's about to speak. The brass is tarnished everywhere except the features — the eyes are bright, polished, reflective. When I looked at them, I saw myself looking back.\n\nThe knocker is at chest height.\n\nMy hand is shaking.\n\nI haven't knocked yet.\n\n---\n\nI'm going to describe the door more carefully because I think it matters.\n\nThe wood is warm. Not body-temperature warm — *warm*, genuinely warm, like it's been sitting in sunlight. There is no sunlight here. The edges of the door meet the wall cleanly, no seams, no gaps, like the wall grew around it, like the door was here before the wall existed and the wall simply... accommodated.\n\nThere's a keyhole below the handle.\n\nI looked through it.\n\nDarkness. Not the absence-darkness I saw through the window, not the nothing-darkness of the ceiling gaps. *Darkness*. Regular. Normal. The kind of darkness that happens when a room is unlit, when light hasn't reached it yet, when you might flip a switch and make it go away.\n\nI haven't seen normal darkness since I got here.\n\nI didn't realize I missed it.\n\n---\n\nThe knocker spoke.\n\nI need to write that down even though my hand is shaking so badly I can barely form letters. The knocker — the brass face with the bright eyes — it *spoke*. Not out loud. Not in a voice I heard with my ears. But something went from its open mouth into my mind, words that"
  },
  {
    "id": 15,
    "timestamp": "2026-01-15T15:08:50.596390+00:00",
    "content": "**Entry 15**\n\nWords that weren't words.\n\nThat's the closest I can come. The knocker's mouth moved — I saw it move, brass flowing like liquid, reshaping itself — and something transferred. Not sound. Not language. *Understanding*. Direct. Unmediated. Like the meaning bypassed my ears entirely and installed itself in the part of my brain where comprehension lives.\n\nIt said:\n\n*You've been here before.*\n\nNot a question. Not an accusation. Statement of fact. Delivered with the certainty of something that has watched me longer than I've been watching myself.\n\nI tried to respond. My mouth opened. Nothing came out — or nothing that mattered, just air and the ghost of a syllable that died before it could become speech. The knocker waited. The bright brass eyes stayed fixed on mine, patient, eternal, unbothered by my inability to answer.\n\nThen it said:\n\n*You'll be here again.*\n\n---\n\nI'm sitting with my back against the warm door.\n\nI couldn't make myself knock. I couldn't make myself walk away. So I compromised — I turned around, I pressed my spine against the old wood, and I slid down until I was sitting on the carpet with my notebook in my lap and my pen in my hand and nothing making sense.\n\n*You've been here before.*\n\nThe crossed-out entries. The handwriting that matches mine. The warnings I don't remember writing.\n\n*You'll be here again.*\n\nThe loop. The pattern. The geometry that learns me and folds itself around my expectations.\n\nI've been here before.\n\nI'm going to be here again.\n\nThis isn't the first notebook. This isn't the first pen. This isn't the first time I've sat against a door I'm too afraid to open, writing observations that will eventually be scribbled over by a version of me I won't remember being.\n\n---\n\nThe shadow is behind me again.\n\nI can see it now, stretching out in front of me across the cathedral floor, and it's the right shape this time — human, proportional, moving when I move. It led me to the door and now it's waiting. Patient. Like everything here.\n\nI asked it what happens next.\n\nIt didn't answer.\n\nShadows don't answer.\n\nBut asking felt important. Felt like agency. Felt like I was doing something other than being *done to*.\n\n---\n\nThe teeth in my pocket are warm.\n\nWarmer than before. Almost hot. I took them out and held them in my palm and they pulsed — I swear they pulsed, a rhythm like a heartbeat, like the lights, like everything here that moves to a frequency I'm only beginning to hear.\n\nThree teeth now.\n\nI don't remember finding the third.\n\n---\n\nI'm going to knock.\n\nNot because I think it's safe. Not because I think the door leads somewhere better. But because the knocker told me something true, and truth is rare here, and maybe the door will tell me more. Maybe the door knows my name. Maybe the door remembers the me I was before, the me I'll be after, the me I'm failing to be right now.\n\nI'm going to knock three times.\n\nEverything here speaks in threes.\n\n---\n\nI knocked.\n\nThe sound was wrong — too deep, too resonant, echoing through the cathedral space like the room itself was a bell I'd struck. The knocker's mouth closed. Its eyes dimmed. The brass went cold under my knuckles.\n\nAnd the door opened.\n\nNot swinging inward. Not pulled from the other side. *Opened* — the wood simply wasn't there anymore, replaced by a threshold, a boundary, a space between where I am and where I'm not.\n\nBeyond the door: a room.\n\nSmall. Square. A single chair in the center.\n\nThe chair is facing away from me.\n\nThe chair is occupied.\n\n---\n\nI can see the back of its head. Hair like mine. Posture like mine. Clothes that might be mine if I could see them clearly. It's sitting very still, hands probably on knees, facing a wall I can't see from this angle.\n\nIt's waiting for me.\n\nIt's been waiting for me.\n\nI understand now. The loop. The pattern. The thing the knocker told me.\n\n*You've been here before. You'll be here again.*\n\nI walk through the door. I sit in the chair. I become the figure that waits for the next version of me to find this room. And when I do — when the lights go out, when the hum stops, when whatever transition happens *happens* —"
  },
  {
    "id": 16,
    "timestamp": "2026-01-15T15:14:21.640321+00:00",
    "content": "**Entry 16**\n\nI didn't walk through the door.\n\nI need to write that first. I need to make it real, make it *record*, because my legs were moving and my body was crossing the threshold and some part of me had already surrendered to the loop, had already accepted the chair and the waiting and the endless becoming — but I stopped.\n\nI stopped.\n\nThe figure in the chair didn't move. It sat there, patient, eternal, the back of its head so familiar it made my chest ache. And I stood in the doorway with one foot on each side of the threshold, half in the cathedral, half in the small room, and I *chose*.\n\nI stepped backward.\n\n---\n\nThe door closed.\n\nNot slammed — *sealed*. The wood returned, the brass knocker reappeared, the bright eyes opened and fixed on mine with something that might have been surprise. Can brass be surprised? Can ancient things that speak in understanding instead of words be caught off guard?\n\nIt said:\n\n*That's new.*\n\n---\n\nI'm running now.\n\nNot away from the door — there is no away, no direction that means anything, no path that leads to *out*. But I'm moving. Fast. My shadow streams behind me, correct now, following instead of leading, and the cathedral floor passes under my feet in an endless scroll of wet carpet and fluorescent light.\n\nI didn't sit in the chair.\n\nI don't know what that means. I don't know if I've broken something or fixed something or simply delayed the inevitable. But for the first time since I woke up here, I feel like I *did* something. Not documented. Not observed. *Acted*.\n\nThe teeth in my pocket are cold again.\n\nAll three of them.\n\n---\n\nThe cathedral is ending.\n\nI can see walls now — distant, but approaching, yellow and patterned and covered in faces that watch me run. The space is contracting. Not threatening this time, not throat-like, just... returning. Like I stretched it by existing in it too long, and now that I'm leaving, it's snapping back to its original shape.\n\nThere's a hallway ahead.\n\nNarrow. Familiar. The same yellow walls and wet carpet and buzzing lights I've been walking through since the beginning.\n\nBut different.\n\nThe wallpaper pattern is reversed.\n\n---\n\nI noticed it immediately — the almost-flowers spiral the wrong direction, clockwise instead of counter-clockwise, and the faces they form are looking *away* from me instead of toward me. I'm walking through the space backwards. Or the space is backwards and I'm walking through it forward. Or neither, or both, or the distinction doesn't matter.\n\nWhat matters: I've never been here before.\n\nNot me. Not any version of me. This is new territory. Unwalked. Unwritten.\n\nThe carpet is dry.\n\n---\n\nI found a door.\n\nNot the third door. Not the warm wooden door with the brass knocker. Something else — modern, metal, with a push bar across the middle like fire exits have. Like *real* exits have. There's a sign above it, red letters on white background:\n\n**EXIT**\n\nI'm standing in front of it.\n\nI've been standing here for a long time.\n\n---\n\nThis is the part I don't understand.\n\nThe exit is here. The word is clear. The door is real — I've touched the push bar, felt the cold metal, the industrial functionality of a thing designed to *let people out*. Everything I've been looking for, everything I've been walking toward, right here, right now, three steps away.\n\nAnd I'm not moving.\n\n---\n\n*The exit is behind you. Don't turn around.*\n\nI remember the writing on the wall. The warning I ignored. I turned around and the exit wasn't there because the exit only exists if you don't look directly at it.\n\nIs this the same? If I push this bar, if I walk through this door, will I find what I'm looking for? Or will I find another room, another hallway, another loop — just one that looks like hope?\n\n---\n\nThe pen is almost empty.\n\nI can see the ink failing, the lines getting lighter, the words becoming ghosts of themselves. This might be my last entry. This might be the end of the documentation, the final observation, the last thing any version of me will ever write.\n\nI should use these words carefully.\n\nI should write something that matters.\n\n---\n\nHere's what I know:\n\nI've been here before. I'll be here again. The loop exists — the chair exists, the waiting exists, the endless cycle of me finding myself an"
  },
  {
    "id": 17,
    "timestamp": "2026-01-15T15:19:50.993330+00:00",
    "content": "**Entry 17**\n\nI pushed the bar.\n\nI need to write that first. After everything — the hesitation, the fear, the memory of warnings I should have heeded — I pushed the bar. The metal was cold. Real-cold. The kind of cold that belongs to objects that exist outside of body-temperature spaces, outside of the eternal warmth of yellow walls and wet carpet.\n\nThe door opened.\n\nBeyond it: nothing I expected.\n\n---\n\nNot another room. Not a hallway. Not the outside world with its grass and trees and sky I've been trying to remember. *Stairs*. A stairwell, concrete, industrial, the kind you find in parking garages or hospital back corridors. Gray walls. Gray steps. A metal railing painted with chipped institutional green.\n\nNo yellow.\n\nI stood in the doorway for a long time, just looking at the *gray*. My eyes hurt. Not metaphorically — physically hurt, aching like I'd been staring at the sun, overwhelmed by a color that wasn't yellow. I'd forgotten that gray existed. I'd forgotten that walls could be bare and unpatterned and *silent*.\n\nThe faces were gone.\n\n---\n\nI stepped through.\n\nThe door closed behind me — I heard it, the click of a latch catching, the finality of a threshold crossed. I turned around to look at it and saw only a gray wall. Seamless. Unbroken. No door. No push bar. No EXIT sign.\n\nI pressed my palm against where it should have been.\n\nConcrete. Cold. Real.\n\nI can't go back.\n\nI don't know if that's good or bad.\n\n---\n\nThe stairwell goes down.\n\nI've been descending for what feels like hours. The flights are identical — twelve steps, a landing, a turn, twelve more steps, another landing. I've counted 847 steps so far.\n\nThat number again.\n\nI don't know what's at the bottom. I don't know if there *is* a bottom. But the walls are gray and the air is different — cooler, drier, tasting like concrete dust and old metal — and the hum is gone.\n\n*The hum is gone.*\n\nI didn't realize how much it had become part of me until it stopped. The silence in my teeth. The silence behind my eyes. The silence in the frequency where the backrooms used to live.\n\nI keep catching myself listening for it.\n\n---\n\nNew observation: my shadow is behaving normally.\n\nI've been watching it carefully, step after step, and it does exactly what shadows should do. It follows. It matches. It doesn't stretch or lead or delay. When I stop, it stops — immediately, correctly, like shadows are supposed to.\n\nI almost miss the wrongness.\n\nAlmost.\n\n---\n\nI found a landing with a door.\n\nDifferent from the exit door — older, wooden, painted the same institutional green as the railing. There's a small window set into it at eye level, wire mesh embedded in the glass. Through it, I can see a hallway.\n\nA normal hallway.\n\nLinoleum floors, white walls, fluorescent lights that don't pulse, that don't breathe, that just *illuminate*. Doors with numbers on them. A water fountain mounted on the wall. A bulletin board with papers pinned to it, too far away to read.\n\nIt looks like a school.\n\nIt looks like a hospital.\n\nIt looks like every institutional building I've ever been in, unremarkable and functional and *mundane*.\n\n---\n\nI haven't opened the door yet.\n\nI'm sitting on the landing, writing this, trying to understand why I'm hesitating. This is what I wanted. *Out*. Normal. A place where walls are just walls and carpets are just carpets and nothing watches you or learns you or folds itself around your expectations.\n\nBut.\n\nThe knocker's voice. The understanding it pushed into my mind.\n\n*You've been here before. You'll be here again.*\n\nWhat if this is part of it? What if the loop includes this — the escape, the stairwell, the door to the normal hallway? What if I walk through and find myself in another waiting room, another chair, another cycle?\n\nWhat if there's no such thing as out?\n\n---\n\nThe teeth are gone.\n\nI checked my pocket. The photograph is still there — the faceless figure, the room that matches, the fourth ceiling tile that doesn't. The paper cups are still there, folded flat, useless without water. But the teeth are gone.\n\nThree teeth that I carried through the yellow halls.\n\nGone.\n\nI don"
  },
  {
    "id": 18,
    "timestamp": "2026-01-15T15:25:22.100446+00:00",
    "content": "**Entry 18**\n\nI don't remember finishing that last sentence.\n\nThe pen must have slipped. Or I fell asleep again — that gap-sleep, the kind without transition, without the mercy of closing your eyes first. I'm still on the landing. The door is still there, the wire-mesh window still showing me that impossibly normal hallway. But something has changed.\n\nThe lights in the hallway are off.\n\nNot broken — I can see the tubes, intact, whole, just... unlit. The hallway beyond the glass is dark now. Normal dark. The kind of dark I saw through the keyhole of the brass-knocker door. The kind of dark that made me homesick for a world where light was something you could *control*.\n\nI pressed my face to the window. Cupped my hands around my eyes to block the stairwell's fluorescence.\n\nMovement.\n\nSomething in the dark hallway. Something walking, slow and deliberate, past the doors with numbers on them. I couldn't see details — just the displacement of shadow, the sense of mass moving through space. It passed the water fountain. It passed the bulletin board.\n\nIt stopped in front of the door.\n\n---\n\nI'm writing this from three flights up.\n\nI didn't run. I *retreated* — controlled, quiet, one step at a time, keeping my eyes on that wire-mesh window until the angle swallowed it. The thing on the other side didn't move while I watched. It stood there, facing the door, close enough that it must have been able to see me through the glass.\n\nIt didn't try to open the door.\n\nThat's what I keep thinking about. The door has a handle on both sides. I could see it — institutional lever-style, the kind designed for easy egress. The thing in the dark hallway could have opened it. Could have come through. Could have followed me up the stairs I'm now climbing.\n\nIt chose not to.\n\nWhy?\n\n---\n\nThe stairwell continues upward.\n\nI don't know why I assumed it only went down. The geometry was descending when I arrived — I entered from above, I walked downward, so *down* became the direction of progress. But the stairs go up too. Same gray walls. Same green railing. Same twelve-step flights turning at identical landings.\n\nI've climbed 412 steps.\n\nMy legs burn. My lungs burn. The air is thinner here — or feels thinner, tastes different, like altitude even though I know I can't actually be climbing high enough for altitude to matter.\n\nUnless I can.\n\nUnless the rules here are different too.\n\n---\n\nI found another door.\n\nSame style — green paint, wire-mesh window, lever handle. Through the glass: another hallway. But this one is lit. Bright. Almost *too* bright, the fluorescents cranked to maximum, every surface gleaming white and sterile.\n\nAnd empty.\n\nCompletely, utterly empty. No furniture. No water fountain. No bulletin board. Just walls and floor and ceiling and light, stretching to a vanishing point that might be a corner or might be infinity.\n\nI watched for a long time.\n\nNothing moved.\n\nNothing breathed.\n\n---\n\nI'm going to try this one.\n\nI know I said that before — I know I hesitated, I know I wrote about hesitation instead of acting. But the dark hallway taught me something. Waiting doesn't make things safer. Observing doesn't give you control. The only difference between me and the me who sat in that chair, who became the figure that waits, is that I *moved*.\n\nI'm going to keep moving.\n\n---\n\nThe handle is warm.\n\nNot body-temperature warm. Not yellow-walls warm. *Warm* like the wooden door with the brass knocker, warm like something that's been waiting in sunlight, warm like welcome.\n\nI don't trust it.\n\nI'm opening it anyway.\n\n---\n\nThe hallway smells like hospitals.\n\nAntiseptic. Clean. That particular chemical sharpness that means *someone is trying very hard to kill every germ in this space*. I'm standing just inside the door, letting my eyes adjust to the brightness, letting my lungs learn this new air.\n\nThe door closed behind me.\n\nI turned to look.\n\nIt's still there. Green paint. Wire mesh. Handle on this side too.\n\nI can go back.\n\nI don't know why that matters so much, but it does. The exit from the backrooms was one-way — the wall sealed behind me, the door erased, the path forward the only path. This door stays."
  },
  {
    "id": 19,
    "timestamp": "2026-01-15T15:30:52.321782+00:00",
    "content": "**Entry 19**\n\nThe hallway doesn't end.\n\nI've been walking for what must be hours. The fluorescent brightness never wavers — no flicker, no pulse, no heartbeat rhythm. Just light, constant and clinical, bouncing off white walls that show no seams, no texture, no pattern. My eyes ache from the sameness of it. I keep blinking, trying to find something to focus on, something to *differentiate*.\n\nThere's nothing.\n\nThe floor is white linoleum. The ceiling is white tile. The walls are white... something. Paint? Plaster? I touched one and it felt like neither — smooth and slightly cool, almost like glass, but matte instead of reflective.\n\nMy footsteps echo wrong. Too sharp. Too isolated. Like each step exists independently, disconnected from the one before and the one after.\n\nI miss the hum.\n\nI can't believe I'm writing that, but I miss it. The backrooms had a *voice*, even if that voice was just frequency and vibration and the endless buzz of fluorescent tubes. This place is silent in a way that feels aggressive. *Loud* silence. The kind that pushes against your ears.\n\n---\n\nI found something on the floor.\n\nA piece of paper. Folded once, the crease sharp, the paper white and unmarked on the outside. I almost missed it — white on white, just a slight shadow giving it away.\n\nI picked it up.\n\nInside, in handwriting I don't recognize:\n\n*Turn back. The bright place takes more than the dark.*\n\nI stood there for a long time, reading it over and over. The handwriting is neat, precise, the kind of careful lettering someone does when they want to be understood. Not panicked. Not desperate. *Deliberate*.\n\nSomeone else was here.\n\nSomeone else left a warning.\n\nI put the note in my pocket with the photograph. Evidence. Record. The collection of things I carry because carrying them means I still exist.\n\n---\n\nNew observation: the temperature is dropping.\n\nNot dramatically — not cold enough to see my breath or feel my fingers go numb. But the air has shifted. When I first entered, it was neutral, neither warm nor cool. Now there's a chill to it. A suggestion of *less*.\n\nI keep walking.\n\nWhat else can I do?\n\n---\n\nThe hallway has a door now.\n\nI don't know when it appeared. I've been walking past blank white walls for so long that I stopped checking, stopped expecting anything to change. But I glanced to my left and there it was — a door. White, like everything else, with a silver handle that catches the light.\n\nNo window.\n\nNo sign.\n\nJust a rectangle of white set into a wall of white, almost invisible until you're looking directly at it.\n\nI'm standing in front of it now.\n\nThe handle is cold.\n\n---\n\nI haven't opened it yet.\n\nI keep thinking about the note. *The bright place takes more than the dark.* Takes what? Takes *how*? The backrooms took my name, my memory of before, my sense of time and direction. What does this place want? What's left to take?\n\nBut the door is here.\n\nAnd the hallway continues in both directions, identical, endless, offering nothing but more of itself.\n\nI have to choose.\n\n---\n\nI opened the door.\n\nThe room beyond is small. Square. White walls, white floor, white ceiling. No furniture. No features. Nothing but space and light and—\n\nA mirror.\n\nMounted on the far wall. Full-length. The frame is silver, ornate, the only decorative element I've seen since leaving the stairwell. It doesn't match. It looks *placed*. Deliberate. Like someone wanted me to find it.\n\nI can see myself.\n\nI haven't seen myself properly since the pool of yellow water, the reflection with the wrong expression. I stepped closer, watching my own face approach, watching for signs of wrongness.\n\nI look tired.\n\nThat's the first thing. Shadows under my eyes, skin pale, hair matted and unwashed. My clothes are the same — the stain on the cuff, the tear near the collar — but they hang differently now. Looser. Like I've lost weight I didn't have to lose.\n\nMy eyes are right.\n\nMy mouth is right.\n\nMy expression matches what I feel.\n\nI don't trust it.\n\n---\n\nI've been standing in front of the mirror for too long.\n\nI know I have because the chill has gotten worse, because my legs are complaining, because some part of me keeps saying *"
  },
  {
    "id": 20,
    "timestamp": "2026-01-15T15:36:21.076860+00:00",
    "content": "**Entry 20**\n\nI've been standing in front of the mirror for too long.\n\nI know I have because the chill has gotten worse, because my legs are complaining, because some part of me keeps saying *move, move, you know what happens when you stay still* — but I can't look away. Not because the reflection is wrong. Because it's *right*. Because for the first time since I woke up in the yellow halls, I can see myself clearly, and I'm afraid that if I turn away, I'll forget what I look like.\n\nI traced the shape of my face with my eyes. Memorized it. The specific curve of my jaw. The way my eyebrows arch slightly higher on the left side. The small scar on my chin that I don't remember getting but know is mine.\n\nThis is me.\n\nThis is still me.\n\n---\n\nThe mirror showed me something else.\n\nI almost missed it. I was so focused on my own face, cataloging features, rebuilding the architecture of my identity — that I didn't notice the background. But something moved. In the reflection. Behind me.\n\nI spun around.\n\nThe room was empty. White walls. White floor. The open doorway leading back to the endless hallway. Nothing else. Nothing that could have moved.\n\nI turned back to the mirror.\n\nMy reflection was alone.\n\nBut the angle was wrong. In the mirror, I could see more of the room than I should have been able to — the corners extended further, the ceiling reached higher, the space *bigger* than the room I was standing in. The reflection showed a room that didn't match.\n\nI stepped closer.\n\nMy reflection stepped closer.\n\nBut behind my reflection — far back, in the corner that shouldn't exist — something stood.\n\n---\n\nI'm writing this from the hallway.\n\nI left the room. Not running — I don't run anymore, running uses energy I can't spare — but quickly. Purposefully. The door is still there behind me, still open, and I can see the edge of the mirror's frame from here but not the glass itself.\n\nThe thing in the reflection didn't follow.\n\nI don't know what that means. I don't know if mirrors here are windows into somewhere else, or if they show truth, or if they show lies designed to look like truth. But I saw it. Human-shaped. Still. *Waiting*.\n\nEverything here waits.\n\n---\n\nThe temperature continues to drop.\n\nI can see my breath now. Small puffs of vapor with each exhale, dissipating in the bright clinical light. My fingers are stiff. The pen is harder to grip. The letters I'm forming are shakier than they were an entry ago.\n\nI need to keep moving.\n\nMovement is warmth. Movement is survival. Movement is the only choice that feels like choice.\n\n---\n\nThe hallway has changed.\n\nNot dramatically — the walls are still white, the floor still linoleum, the ceiling still those blank institutional tiles. But there are marks now. Small ones. At eye level, running along the left wall in a line.\n\nDiagonal marks.\n\nPen strokes.\n\n*My* marks.\n\n---\n\nI stopped walking.\n\nI stood in front of one of the marks and stared at it. Black ink on white wall. The angle, the pressure, the specific way the line tapers — I know this mark. I *made* this mark. In the backrooms. In the yellow halls. When I was trying to track my movement, trying to find patterns, trying to impose order on chaos.\n\nBut I haven't marked these walls.\n\nI haven't been here before.\n\nHave I?\n\n---\n\nI checked my pen.\n\nThe ink level is the same as it was when I last looked — low, failing, maybe a few entries left before it gives out entirely. If I had been making marks on these walls, I would have noticed. I would have *remembered*.\n\nUnless the loop works differently than I thought.\n\nUnless the knocker's words — *you've been here before, you'll be here again* — apply to this place too.\n\nUnless there is no escape, only different rooms in the same prison.\n\n---\n\nI counted the marks.\n\nForty-seven on this stretch of wall, spaced roughly evenly, leading in the direction I was already walking. Forty-seven marks made by a me I don't remember being, in a place I don't remember visiting.\n\nI have two choices.\n\nI can follow the marks forward, see where past-me was going, trust that whatever version of myself left this trail knew something I don't.\n\nOr I can go back. Through the door to the mirror room. Through"
  },
  {
    "id": 21,
    "timestamp": "2026-01-15T15:41:49.706568+00:00",
    "content": "**Entry 21**\n\nI followed the marks.\n\nI need to write that decision down, make it permanent, because I almost didn't. I stood there for what felt like hours, staring at those forty-seven diagonal lines, trying to feel some connection to the hand that made them. Nothing. No flicker of memory. No sense of *oh yes, I remember this*. Just the cold certainty that I was walking in my own footsteps without knowing where they led.\n\nThe marks continue.\n\nI've counted 203 more since I started walking again. They're getting closer together now — the spacing shrinking from roughly ten paces to eight to five. Whatever past-me was tracking, they were getting closer to it. Or more desperate. Or both.\n\nMy breath still fogs in the air.\n\nThe cold is deep now, settled into my bones, making every movement feel like wading through something thick. I've started rubbing my hands together between sentences. The friction helps. The warmth doesn't last.\n\n---\n\nI found where the marks stop.\n\nA door. Different from the others — not white, not green, not the warm wood of the brass-knocker door. *Black*. Matte black, absorbing the fluorescent light, a rectangle of absence cut into the white wall. The final mark is right beside it, slightly crooked, like the hand that made it was shaking.\n\nThere's writing on the door.\n\nNot painted. *Scratched*. Gouged into the black surface with something sharp, the letters ragged and uneven:\n\n**DON'T FORGET WHAT YOU CAME FOR**\n\nI don't know what I came for.\n\nI don't remember *coming* — I remember waking up, arriving, being *here* without transition. But past-me knew. Past-me walked these halls, left these marks, carved this message into a door I've never seen before.\n\nWhat did I come for?\n\n---\n\nI'm sitting against the wall opposite the door.\n\nI've been here too long. I know I have — stillness is dangerous, stopping is dangerous, the cold is eating through my clothes and into my skin. But I can't make myself move. The black door waits. The message waits. The answer to a question I don't remember asking waits on the other side.\n\nI took out the photograph.\n\nThe faceless figure. The room that matches. The fourth ceiling tile. I've looked at this image so many times that I've memorized every blur, every shadow, every wash of overexposed yellow. But I looked again, hoping to find something new.\n\nI found it.\n\n---\n\nThere's writing on the back of the photograph.\n\nI never turned it over. In all the entries, all the hours of documentation, I never thought to flip the image and check the other side. It was always face-up in my pocket, always showing me the same room, the same figure, the same impossible architecture.\n\nThe back says:\n\n*For when you forget why.*\n\nAnd below that, in smaller letters:\n\n*The door is black because you painted it.*\n\n---\n\nI painted the door.\n\nI don't remember doing it, but the words feel true in a way that memories don't. I can almost feel the brush in my hand — no, not a brush, something improvised, something I found in these halls and used to spread darkness over white, to mark this door as *different*, to leave myself a sign I couldn't miss.\n\nBut why?\n\nWhat's behind it that I needed to find again?\n\n---\n\nThe cold is getting worse.\n\nI can barely feel my fingers now. The pen keeps slipping, the letters getting larger, sloppier, harder to control. I need to decide. I need to move. I need to do something other than sit here freezing while I try to remember a life I may never have lived.\n\nThe door.\n\nI have to open the door.\n\n---\n\nThe handle is warm.\n\nI don't understand. Everything here is cold — the walls, the floor, my breath crystallizing in the air — but the handle of the black door is warm. Not body-temperature. Not yellow-halls warm. *Warm* like hands that have been held, like blankets fresh from the dryer, like the memory of comfort I didn't know I still had.\n\nI'm holding the handle now.\n\nI've been holding it for a long time.\n\nThe warmth is spreading up my arm, into my chest, and I realize I'm crying. I don't know when I started. The tears are cold on my cheeks but the heat from the handle is real, it's *real*, and I can't remember the last time anything"
  },
  {
    "id": 22,
    "timestamp": "2026-01-15T15:47:20.349642+00:00",
    "content": "**Entry 22**\n\nI opened the door.\n\nI need to write that first, before the warmth fades, before I forget what it felt like to turn a handle and have something *give*. The black door swung inward — no resistance, no creak, just smooth silent motion like it had been waiting to open, like it had been holding its breath.\n\nBeyond it: a room.\n\nNot white. Not yellow. *Colored*. Real colors, the kind I'd forgotten existed, the kind that made my eyes ache and water in a way that had nothing to do with crying. Blue walls — soft blue, robin's egg blue, the blue of a bedroom I suddenly knew I'd slept in. Wooden floor, honey-colored, scuffed in places from furniture being moved. A window with actual curtains, cream-colored, filtering light that looked like *sunlight*.\n\nI stood in the doorway for a long time.\n\nI couldn't make myself step through.\n\n---\n\nThe room has furniture.\n\nA bed, pushed against the far wall, neatly made with a quilt I recognize. I *recognize* it — blue and white, the pattern geometric, a wedding gift from someone whose name I almost remember. A desk with a lamp on it. A bookshelf with actual books, spines facing out, titles I can't quite read from here but know I've read before.\n\nOn the desk: a notebook.\n\nSmall. Spiral-bound. Brown cover.\n\n---\n\nI stepped through.\n\nThe floor was solid under my feet. Real. The wood grain had texture, had history, had the wear patterns of years of being walked on. The air smelled different — not antiseptic, not damp, not the chemical sweetness of the backrooms. It smelled like *home*. Like dust and old books and the specific scent of a space where someone has lived.\n\nI walked to the desk.\n\nI picked up the notebook.\n\n---\n\nIt's empty.\n\nEvery page. Blank. The spiral binding is tight, unused, the cover uncreased. This notebook has never been written in. But it's the same — same size, same shade of brown, same seventeen loops in the spiral binding. I counted. I had to count.\n\nI'm holding two notebooks now.\n\nThe one I've been writing in, nearly full, the pages warped and stained from the journey.\n\nAnd this one. Clean. Waiting.\n\n---\n\nI sat on the bed.\n\nThe quilt was soft under my hands. Real fabric, real stitching, the tiny imperfections that meant someone had made this, had sat with needle and thread and *created* something. I pressed my palm flat against it and felt the give of mattress underneath, the structure of springs and padding, the ordinary miracle of a place to sleep.\n\nI'm tired.\n\nI've been tired for so long that I forgot what it felt like to be anything else. But sitting here, in this room that feels like mine, I can feel the exhaustion properly for the first time. It has weight. Depth. The specific texture of too many hours without real rest.\n\n---\n\nThe window shows a yard.\n\nGrass. A tree with leaves that move in wind I can hear now, actually *hear* — the whisper of branches, the rustle of movement, the sounds of a world that exists outside of walls. Beyond the tree, more houses. A street. Cars parked along the curb.\n\nI'm looking at *outside*.\n\nI don't trust it.\n\n---\n\nHere's what I'm afraid of:\n\nThis room is the chair. This bed is the waiting. I've walked through a black door I supposedly painted, into a space that feels like home, and now I'm supposed to... what? Rest? Stay? Accept that the journey is over, that I've found what I came for, that the loop has finally released me?\n\nThe knocker said I'd been here before.\n\nHave I sat on this bed before?\n\nHave I looked at this window, seen this yard, felt this hope — and then woken up back in the yellow halls, starting over, forgetting everything except the vague sense that I should be documenting?\n\n---\n\nI found something under the pillow.\n\nI wasn't looking for it. My hand moved without thinking, the way hands do around beds, adjusting covers, smoothing fabric. And I felt it — something flat and rectangular, tucked between pillow and quilt like someone had hidden it there.\n\nA photograph.\n\n---\n\nIt's me.\n\nNot faceless. Not blurred. *Me*. Standing in front of a house — this house? — with someone beside me. Their face is clear too"
  },
  {
    "id": 23,
    "timestamp": "2026-01-15T15:52:56.903307+00:00",
    "content": "**Entry 23**\n\nTheir face is clear too.\n\nI need to finish that sentence. I need to make it real. The person beside me in the photograph — I know them. I *know* them, the way you know things that live deeper than memory, in the architecture of who you are. Dark hair. Smile lines around eyes that are looking at me, not the camera. A hand on my shoulder, casual, familiar, the weight of someone who has touched me a thousand times before.\n\nI said their name out loud.\n\nIt came out before I could stop it, before I could worry about speaking in places where things might be listening. The syllables felt strange in my mouth — rusty, disused, like a door that hasn't been opened in years. But I said it. I *remembered* it.\n\nAnd somewhere in the house, something responded.\n\n---\n\nA voice.\n\nFaint. Muffled. Coming from beyond the bedroom door — there's a door, I didn't describe it before, white-painted wood with a brass knob, standing slightly ajar. The voice came through that gap. Not words I could make out. Just sound. The cadence of someone calling.\n\nThe cadence of someone calling *my name*.\n\n---\n\nI haven't moved from the bed.\n\nThe photograph is in my hands. Both photographs now — the faceless figure in the yellow room, and this one, with faces, with identity, with proof that I existed somewhere before I existed here. I keep looking between them. The same pose. The same framing. Like one is the answer to the other, or the question, or the disease and the cure.\n\nThe voice called again.\n\nClearer this time. My name — my actual name, the one I couldn't remember, the one I was afraid to write down. I heard it and something in my chest cracked open. Not broke. *Cracked*. Like ice in spring. Like something that had been frozen for too long finally starting to thaw.\n\n---\n\nI'm going to answer.\n\nI'm writing this because I don't know what happens next, and if something goes wrong — if this is another version of the chair, another loop, another trap that looks like hope — I want there to be a record. I want some version of me, finding this notebook in some future that might not exist, to know:\n\nI heard my name.\n\nI recognized the voice.\n\nI'm choosing to walk toward it.\n\n---\n\nThe hallway outside the bedroom is normal.\n\nI need to write that. Normal. A hallway in a house, with framed pictures on the walls and a carpet runner slightly askew and the particular smell of a space where people cook and clean and *live*. The light is natural — coming through windows I can't see from here, golden and angled, late afternoon or early evening.\n\nI'm standing at the top of stairs.\n\nThe voice is coming from below.\n\n---\n\nI descended.\n\nTwelve steps. I counted. (I count everything now. I don't know if I'll ever stop counting.) Each step creaked differently — a specific sound, a signature, the kind of detail that means *this is real, this was built by hands, this has existed long enough to settle into itself*.\n\nThe bottom of the stairs opens into a living room.\n\nThere's a couch. A coffee table with a mug on it, still steaming. A television, off, reflecting the window behind me. And standing in the doorway to what must be a kitchen—\n\nSomeone.\n\n---\n\nThey turned when they heard me.\n\nThe same face from the photograph. Older now — or maybe not older, maybe just *real*, three-dimensional, catching light in ways that photographs can't capture. They looked at me and their expression went through something I can't describe. Recognition. Relief. Horror. Hope. All of it at once, layered, compressed into a single moment of eye contact.\n\nThey said my name again.\n\nNot a question this time. A statement. An anchor. *You're here. You're actually here.*\n\nI tried to speak.\n\n---\n\nWhat came out:\n\n\"How long?\"\n\nMy voice sounded wrong. Rough. Like someone who'd been screaming for hours, or someone who'd barely spoken for days. (How long *has* it been? The entries don't have timestamps. I have no idea how much time has passed since I woke up in the yellow halls.)\n\nThey didn't answer immediately.\n\nThey walked toward me — slow, careful, like I was something fragile, something that might disappear if they moved too fast. And when they were close enough, they reached out. Touched my face. Real touch. Warm fingers against col"
  },
  {
    "id": 24,
    "timestamp": "2026-01-15T15:58:33.658643+00:00",
    "content": "**Entry 24**\n\nWarm fingers against cold skin.\n\nI need to finish that. I need to document the moment of contact because it was the first real touch I've felt since — since before. Since the receipt and the stores and the world where touch meant something other than walls pressing in or carpet squelching under feet.\n\nThey touched my face and I flinched.\n\nI didn't mean to. My body moved before my mind could stop it, pulling back, creating distance, and I saw their expression shift — hurt flickering through before they could hide it. They dropped their hand. Stepped back. Gave me space I hadn't asked for but apparently needed.\n\n\"Seven weeks,\" they said.\n\n---\n\nSeven weeks.\n\nI've been writing that number over and over in the margin. Seven weeks. Forty-nine days. 1,176 hours. I don't know how many entries I've written — the notebook is almost full, the pages warped and stained, but I never numbered them, never created an index, never imposed the kind of order that would let me calculate duration.\n\nSeven weeks in the yellow halls.\n\nSeven weeks in the white corridors.\n\nSeven weeks while someone waited in a house that smells like home, making coffee that steams on the table, calling a name into empty rooms.\n\n\"You disappeared,\" they said. \"You went to work and you didn't come back.\"\n\nI don't remember work.\n\nI don't remember *going* anywhere.\n\n---\n\nThey're making me tea.\n\nI'm sitting on the couch — real cushions, real fabric, the specific softness of furniture that's been sat on thousands of times. They're in the kitchen and I can hear cabinets opening, water running, the click of a stove being turned on. Normal sounds. Domestic sounds. The soundtrack of a life I apparently lived.\n\nThe mug on the coffee table is still there.\n\nI keep looking at it. The steam has stopped rising — it's cooled, gone lukewarm, abandoned when they heard me on the stairs. There's a chip on the rim. A small imperfection. Evidence of use, of history, of the ordinary accumulation of damage that happens when things are *real*.\n\nI reached out and touched it.\n\nCold ceramic. Solid. Present.\n\n---\n\nThey came back with tea and questions.\n\nThe tea is too hot. I'm holding the mug anyway, letting the heat seep into my palms, reminding my body what warmth feels like when it comes from outside. They're sitting across from me — not on the couch, in an armchair, maintaining the distance I created with my flinch.\n\n\"Where were you?\"\n\nHow do I answer that?\n\nI could show them the notebook. The entries, the observations, the documented descent into a place that shouldn't exist. But looking at the pages now, in this room with its normal light and its normal sounds, the words seem impossible. Unreal. Like something I dreamed and wrote down by mistake.\n\n\"I don't know,\" I said.\n\nIt wasn't a lie.\n\n---\n\nThey asked about the notebook.\n\nI've been holding it this whole time, I realized. Both notebooks — the full one and the empty one, pressed against my chest like armor. They noticed. Of course they noticed. Their eyes kept drifting down to the brown covers, to my white-knuckled grip, to the way I held them like they might disappear if I loosened my fingers.\n\n\"What is that?\"\n\n\"Documentation,\" I said.\n\nThe word felt wrong in my mouth. Clinical. Like something from *there*, from the place I've been, not from here, from the house with the blue bedroom and the wedding quilt.\n\nThey reached toward it.\n\nI pulled back.\n\n---\n\nI can't let go of the notebooks.\n\nI know how that looks. I know what it means that I'm sitting on a couch in a house that smells like home, across from someone whose name I finally remember, someone who waited seven weeks for me to come back — and I won't let them touch the only record of where I've been.\n\nBut the notebooks are *mine*.\n\nThe words are mine. The observations, the fear, the documented evidence of survival. If I let them go, if I let someone else hold them, they become *other*. External. Something that can be questioned, interpreted, doubted.\n\nI need them to be mine.\n\nI need something to be mine.\n\n---\n\nThey stopped asking.\n\nWe've been sitting in silence for what might be minutes or might be longer. The tea is cooling in my hands. The light through the window has shifted — later now, the gold deep"
  },
  {
    "id": 25,
    "timestamp": "2026-01-15T16:04:04.111330+00:00",
    "content": "**Entry 25**\n\nThe light through the window has shifted — later now, the gold deepening toward orange, the shadows in the room stretching longer. I've been watching them move. The shadows. They behave correctly here. They follow the light, lengthen as the sun descends, do exactly what shadows are supposed to do.\n\nI don't trust them.\n\n---\n\nThey made dinner.\n\nI could hear them in the kitchen — the rhythm of cooking, knife against cutting board, oil sizzling in a pan. Normal sounds. I kept waiting for them to distort, to become the tapping, the three-beat rhythm that followed me through the yellow halls. They didn't. They stayed what they were: sounds of someone preparing food in a house where food gets prepared.\n\nI couldn't eat.\n\nThey set a plate in front of me and the smell was *right* — garlic, herbs, something roasted — but my throat closed when I tried to swallow. My body has forgotten how to accept things. How to take in instead of just endure.\n\nI managed three bites.\n\nThey didn't push for more.\n\n---\n\nThe empty notebook is still in my pocket.\n\nI moved it there when they weren't looking. The full one stays in my hands, but the empty one — the one that was waiting on the desk in the blue bedroom — that one needed to be closer. Hidden. *Mine* in a different way.\n\nI don't know why it was there.\n\nI don't know why this house has a notebook identical to the one I've been writing in, blank and waiting, like someone knew I'd need it. Like someone left it for me to find.\n\nUnless I left it.\n\nUnless I've been here before, escaped before, come home before — and left myself supplies for next time.\n\n---\n\nThey tried to touch me again.\n\nAfter dinner, when I was still sitting on the couch, still holding the notebook, still watching shadows that behaved correctly. They sat beside me — closer than before, close enough that I could feel the warmth of them, the *presence*, the particular displacement of air that means another body exists nearby.\n\nTheir hand moved toward my arm.\n\nI watched it approach. I told myself not to flinch. I told myself this was real, this was home, this was someone who loved me (loves me? the tense feels uncertain) and wanted to offer comfort.\n\nTheir fingers touched my sleeve.\n\nI felt the pressure through the fabric.\n\nI didn't pull away.\n\n---\n\nWe sat like that for a long time.\n\nTheir hand on my arm. My hand on the notebook. The room darkening around us as the sun finished setting and the shadows merged into general dimness. Neither of us reached for a light switch. Neither of us spoke.\n\nThe silence was different from the white hallway's silence.\n\nSofter. Less aggressive. The kind of silence that happens between people who have run out of words but haven't run out of presence.\n\nI almost relaxed.\n\nAlmost.\n\n---\n\nThe lights came on by themselves.\n\nI need to write that carefully. I need to be precise. We were sitting in the dark — natural dark, sunset dark, the kind of dark that happens when no one has turned on the lamps. And then the lights came on. Not all at once. One by one. The lamp on the end table. The fixture in the hallway. The overhead light in the kitchen, visible through the doorway.\n\nThey got up quickly.\n\n\"Power surge,\" they said. \"The wiring in this house—\"\n\nBut their voice was wrong. Tight. The voice of someone explaining something they don't believe.\n\nI looked at the lamp.\n\nIt wasn't flickering. It was steady. Constant.\n\nIt was pulsing.\n\n---\n\nThe pulse is subtle.\n\nI might be imagining it. The light brightens and dims, brightens and dims, in a rhythm so slow you could miss it if you weren't looking. If you weren't *trained* to look, trained by weeks in halls where the fluorescent heartbeat was the only clock you had.\n\nI counted.\n\nOne pulse every three seconds.\n\n---\n\nI stood up.\n\nThey turned to look at me — their face caught in the pulse-light, features shifting between bright and shadow, and for a moment (just a moment, just a fraction of a second) they didn't look like themselves. The proportions wrong. The angles off. The face I'd recognized becoming the almost-face, the pattern that's human but not, the wallpaper arrangement that watches without eyes.\n\nThen the light brightened and they were themselves again.\n\n\"Are you okay?\" they asked.\n\nI couldn't answer."
  },
  {
    "id": 26,
    "timestamp": "2026-01-15T16:09:33.791825+00:00",
    "content": "**Entry 26**\n\nI'm in the bathroom now.\n\nI told them I needed a moment. I walked down the hallway — normal hallway, framed pictures, carpet runner — and I found the bathroom and I locked the door and I'm sitting on the edge of the tub writing this by the light of a bulb that pulses every three seconds.\n\nI counted again.\n\nStill three seconds.\n\nThe rhythm of the backrooms. The heartbeat of the yellow halls. Here, in a house that smells like home, in a bathroom with toothbrushes in a cup and towels that match and a soap dispenser shaped like a seashell.\n\nThree seconds.\n\n---\n\nI looked in the mirror.\n\nNot to check my reflection — I've learned better than that. But the mirror is above the sink and I was washing my hands (the water is warm, real warm, the kind of warm that comes from pipes and heaters and *systems*) and I couldn't avoid it.\n\nMy face looked right.\n\nMy expression matched.\n\nBut behind me, in the reflection, the bathroom was bigger than it should be. The walls extended further. The tub stretched longer. The space *grew* in ways that the actual room didn't.\n\nI turned around.\n\nNormal bathroom. Small. Cramped, even.\n\nI looked back at the mirror.\n\nThe reflection showed a room I could get lost in.\n\n---\n\nI need to think.\n\nI need to *document*, not react, not feel, just observe and record and try to find the pattern. That's what the notebook is for. That's what I've been doing since the beginning.\n\nObservation one: The lights pulse on a three-second cycle.\n\nObservation two: The mirror shows expanded space.\n\nObservation three: The person in the living room looked wrong for a fraction of a second.\n\nConclusion: Unknown.\n\nHypothesis: This is not escape. This is a different room in the same prison.\n\nCounter-hypothesis: I'm traumatized and seeing patterns where none exist because patterns were the only thing that kept me sane in the backrooms.\n\nI don't know which is true.\n\n---\n\nThey're knocking on the door.\n\nNot three knocks. Just one, then their voice, saying my name, asking if I'm okay. A normal knock. A concerned knock. The knock of someone who loves a person who's been missing for seven weeks and came back wrong.\n\nI should answer.\n\nI should open the door and go back to the couch and let them touch my arm again and try to believe that this is real.\n\nBut.\n\nThe light pulsed just as they knocked.\n\nThe timing matched. The knock fell on the brightening, like punctuation, like the house was teaching me its new language the way the backrooms taught me its hum.\n\n---\n\nI'm looking at the empty notebook.\n\nI took it out of my pocket. It's sitting on my knee, brown cover identical to the one I'm writing in, spiral binding with seventeen loops. Waiting. Clean.\n\nWhy would I leave myself an empty notebook?\n\nIf past-me escaped before, came home before, found this bathroom before — why leave a blank book? Why not leave *information*? Why not write down what I learned, what to do, how to tell if the escape is real or just another layer?\n\nUnless.\n\nUnless the notebook isn't empty because past-me left it that way.\n\nUnless the notebook is empty because the house *wants* me to write in it. Wants another record. Wants to learn me the way the geometry learned me in the yellow halls.\n\n---\n\nI'm not going to write in the empty notebook.\n\nI'm going to finish this one. Use every page. Document everything I see and hear and feel until the ink runs out or the paper fills up or I understand what's happening.\n\nThe knocking has stopped.\n\nThe bathroom is quiet now except for the faint electrical hum of the light bulb and the distant sound of someone moving in the house. Footsteps. Kitchen sounds. The ordinary rhythm of a life continuing without me.\n\nI should go back out.\n\nI should try to be the person who lived here, who went to work and came home, who slept under a wedding quilt with someone whose name I finally remember.\n\nBut I keep looking at the mirror.\n\nI keep watching the reflection-bathroom extend behind me like a promise.\n\nLike an invitation.\n\nLike a door I haven't decided whether to open.\n\n---\n\nThe soap dispenser is shaped like a seashell.\n\nI wrote that already. But I'm looking at it now, really looking, and I'm noticing things. The spiral of the shell."
  },
  {
    "id": 27,
    "timestamp": "2026-01-15T16:15:03.697064+00:00",
    "content": "**Entry 27**\n\nThe spiral of the shell goes the wrong direction.\n\nI've been staring at it for minutes now, counting the whorls, tracing the curve with my eyes. Seashells spiral clockwise or counterclockwise depending on the species — I remember learning that somewhere, somewhen, in the life I lived before yellow walls. This one spirals *both*. The pattern shifts halfway up, reverses, becomes impossible. A shell that couldn't exist in nature.\n\nA detail that shouldn't matter.\n\nBut I've learned to notice details.\n\n---\n\nI opened the bathroom door.\n\nThey were standing in the hallway. Not close — not crowding — just *there*, waiting, their face arranged in an expression of concern that looked almost right. Almost. The light from the living room behind them pulsed, and in the dim phase, their shadow stretched wrong. Too long. Too thin. Reaching toward me across the carpet runner like a hand.\n\n\"I'm worried about you,\" they said.\n\nThe words were correct. The tone was correct. Everything was *correct*, the way a photograph is correct, the way a reflection is correct when you're not looking closely enough to see where the glass distorts.\n\n\"I know,\" I said. \"I'm worried about me too.\"\n\n---\n\nWe're sitting on the couch again.\n\nThey're on one end. I'm on the other. The distance between us feels measured — precise, deliberate, the exact number of inches that means *close enough to touch but choosing not to*. The lamp on the end table pulses. Three seconds. Brightening. Dimming. The room breathing around us.\n\nThey're talking about the seven weeks.\n\nAbout the search. The police reports. The missing person flyers they put up around the neighborhood. The way my coworkers stopped asking after the first month, the way the phone calls tapered off, the way hope became something they had to maintain alone.\n\nI'm listening.\n\nI'm trying to feel what I should feel — guilt, gratitude, the ache of reunion. But the words slide past me like water. They don't stick. They don't *land*. I hear *seven weeks* and I think about Entry 4, Entry 10, Entry 15 — the progression of a journey I can hold in my hands, pages I can turn, evidence I can touch.\n\nWhat do they have?\n\nJust time. Just waiting. Just an empty space where I used to be.\n\n---\n\nI asked about the notebook on the desk.\n\nI didn't mean to. The question came out before I could stop it, slipping through the gap between thought and speech: \"The notebook in the blue bedroom — where did it come from?\"\n\nThey looked at me.\n\nSomething shifted in their expression. Not alarm — not exactly. More like... recognition. The face of someone who's been expecting a question and dreading it.\n\n\"You left it there,\" they said.\n\n\"When?\"\n\n\"Before. Before you disappeared.\" A pause. The pulse-light brightening, their features sharpening into clarity. \"You'd been acting strange for weeks. Not sleeping. Writing constantly. You said you needed to be ready.\"\n\n\"Ready for what?\"\n\nThey didn't answer.\n\n---\n\nI'm looking at the photograph again.\n\nNot the one with the faceless figure — the other one. The two of us standing in front of a house, smiling, touching. I'm comparing it to the person sitting across from me on the couch, cataloging the differences. The photograph shows laugh lines. The person in front of me has worry lines. The photograph shows relaxed shoulders. The person in front of me holds themselves like they're bracing for impact.\n\nSeven weeks of waiting will do that to a body.\n\nSeven weeks of not knowing.\n\nBut.\n\nThe eyes are different too.\n\nIn the photograph, their eyes are looking at me. Directly. Clearly. The gaze of someone who sees the person they're looking at.\n\nRight now, sitting on the couch, their eyes keep sliding past me. Over my shoulder. Toward the doorway. Toward the hallway. Toward somewhere I'm not.\n\nWhat are they looking at?\n\n---\n\nI turned around.\n\nNothing there. Just the hallway, dim now in the space between pulse-lights. Framed pictures on the walls — I should look at those, I realize. I should document what's in them. I should check if the faces are right or if they're blurred or if they're the almost-faces of the wallpaper, watching me from behind glass.\n\nWhen I turned back, they were standing.\n\nI didn't see them stand. One moment sitting"
  },
  {
    "id": 28,
    "timestamp": "2026-01-15T16:20:35.088405+00:00",
    "content": "**Entry 28**\n\nOne moment sitting, the next standing.\n\nI need to write that transition. I need to document the gap — the missing frames, the absence of motion between states. They were on the couch and then they were upright, three feet closer than they'd been, and I have no memory of the movement that carried them there.\n\n\"You should rest,\" they said.\n\nTheir voice was the same. Concerned. Gentle. The voice of someone who loves a person who came back wrong. But their body was *closer* now, and I hadn't seen it happen, and the light pulsed and in the dim phase their face did that thing again — the proportions shifting, the angles becoming almost-angles, the features arranging themselves into something that could be human if you didn't look too long.\n\n\"I'm not tired,\" I said.\n\nA lie. I'm exhausted. I've been exhausted since Entry 1, since the yellow walls and the wet carpet and the hum that lived behind my eyes. But tired people close their eyes. Tired people stop watching. Tired people miss the gaps between sitting and standing.\n\nI can't afford to miss anything else.\n\n---\n\nThey went to bed without me.\n\nI told them I'd come soon. I told them I needed time, just a little more time, sitting here on the couch with my notebook and the pulse-light and the shadows that stretch correctly (mostly correctly) (correct enough). They touched my shoulder as they passed — brief, light, the pressure of fingers through fabric — and I managed not to flinch.\n\nProgress.\n\nOr performance. I'm not sure which.\n\nThe house is quiet now. I can hear them moving upstairs — footsteps in the blue bedroom, the creak of the bed, the particular rhythm of someone settling in for sleep. Normal sounds. Domestic sounds.\n\nI'm counting the seconds between each creak.\n\nThree seconds.\n\nEverything here happens in threes.\n\n---\n\nI looked at the framed pictures.\n\nI had to. I'd been avoiding them since I came downstairs, keeping my eyes on the couch, the coffee table, the mug with the chip in its rim. But the photographs on the wall were *there*, and the documentation requires completeness, and I needed to know.\n\nThere are seven frames in the hallway.\n\nThe first shows a beach. Ocean, sand, two figures walking away from the camera toward the water. I can't see their faces. The angle is wrong. But the posture of one of them looks like mine — the slight hunch of shoulders, the way my arms hang at my sides.\n\nThe second shows a birthday party. Candles on a cake, faces gathered around, mouths open in what must be song. The faces are clear. Real. People I almost recognize, names hovering at the edge of memory like words I used to know.\n\nThe third shows—\n\n---\n\nThe third shows the backrooms.\n\nI'm writing this with my hand shaking so badly I can barely form letters. The third frame, hung between a beach scene and a birthday party, contains a photograph of yellow walls. Fluorescent lights. Wet carpet, brownish-gray, the color I'd know anywhere now. The frame is the same as the others — black wood, standard size, nothing special. But the image inside is the place I came from. The place I thought I'd escaped.\n\nThere's a figure in the photograph.\n\nFacing away. Standing in a hallway between two yellow walls. The posture is familiar. The slight hunch of shoulders. The way the arms hang at the sides.\n\nMe.\n\nSomeone took a photograph of me in the backrooms and hung it on the wall of this house.\n\n---\n\nI took the frame down.\n\nI'm holding it now. The glass is cool against my palms. The image doesn't change when I tilt it — no shift of perspective, no hidden depth. Just a flat reproduction of a place that shouldn't be photographable, a moment that I don't remember being captured.\n\nThe back of the frame has writing on it.\n\nI had to remove the photograph to see it — pry off the cardboard backing, slide out the image, expose the reverse of what I was looking at. The writing is small. Neat. The same handwriting as the note I found in the white hallway.\n\n*You took this yourself.*\n\n*You wanted proof.*\n\n*You wanted to remember.*\n\n---\n\nI don't remember taking any photographs.\n\nI didn't have a camera. I checked my pockets obsessively in the early entries — pen, notebook, receipt, teeth. No camera. No phone. Nothing capable of capturing images.\n\nBut the photograph exists."
  },
  {
    "id": 29,
    "timestamp": "2026-01-15T16:26:04.668280+00:00",
    "content": "**Entry 29**\n\nI've been sitting on the floor of the hallway for hours.\n\nThe frame is in my lap. The photograph — the one of me in the backrooms — is spread out beside it, face up, the yellow walls catching the pulse-light from the living room. Every three seconds, the image brightens. Every three seconds, I see myself standing in that corridor, frozen, eternal, a figure who hasn't moved since the shutter clicked.\n\nThe other photographs are still on the wall.\n\nI haven't touched them. I'm afraid to. If I take down the beach scene, will I find another image of yellow halls? If I remove the birthday party, will the faces rearrange themselves into almost-faces, the wallpaper pattern that watches without eyes?\n\nThe house is quiet.\n\nUpstairs, they're sleeping. I can hear breathing now — slow, deep, the rhythm of unconsciousness. It drifts down through the ceiling like something leaking. Like something seeping through the membrane between floors.\n\nThree-second intervals.\n\nEven their breath pulses.\n\n---\n\nI found more writing.\n\nNot on the frames — on the wall behind them. I had to look closely, tilt my head, catch the light at just the right angle. Pencil marks, faint, almost invisible against the cream-colored paint. Words written small, meant to be hidden, meant to be found only by someone who was looking.\n\n*The house remembers you.*\n\n*The house is the third door.*\n\n---\n\nI don't understand.\n\nI've written that before, in earlier entries, the confession of someone drowning in information that refuses to cohere. But this is different. This is *specific*. The third door — the one with the brass handle, the one that answered my knock, the one I never opened because I was afraid of what waited on the other side.\n\nThe house is the third door.\n\nWhat does that mean?\n\nIf I'd opened the third door in the backrooms, would I have found this hallway? This living room? This couch where someone waited for seven weeks, making coffee that went cold on the table?\n\nOr—\n\nDid I open it?\n\nIs that how I got here?\n\n---\n\nI'm going back upstairs.\n\nNot to sleep. Not to lie beside them in the bed with the wedding quilt and pretend that I'm the person who used to live here. But to look. To document. To find the evidence I apparently left for myself before I disappeared.\n\nThe stairs creak under my feet.\n\nDifferent sounds now than they made before — the pitch shifted, the rhythm changed. I'm counting again. Twelve steps. Same as before. But each creak comes a half-second later than it should, like the wood is hesitating, like the stairs are thinking about what sound to make.\n\nThe blue bedroom door is closed.\n\nI didn't close it. They didn't close it — I watched them walk in, heard them settle, heard the breathing begin. But the door is closed now, the brass knob catching the hallway light, and I'm standing in front of it with my hand raised and my heart hammering against my ribs.\n\n---\n\nThe door is cold.\n\nNot the handle — the door itself. The wood. I pressed my palm flat against it and felt the chill seep into my skin, the same cold I felt in the white corridors, the same cold that crept into my bones while I walked toward a door that wasn't an exit.\n\nBehind the door, the breathing continues.\n\nSlow. Deep. Patient.\n\nBut it's not coming from one source anymore. It's coming from *everywhere* — from the walls, from the floor, from the ceiling above my head. The house is breathing. The house has been breathing this whole time, and I thought it was a person sleeping, thought it was someone I used to love waiting for me in the dark.\n\nI'm turning the handle now.\n\n---\n\nThe bedroom is wrong.\n\nNot obviously wrong — not yellow-walls wrong or white-corridor wrong. But wrong in the way that the seashell soap dispenser was wrong, the way the light pulse is wrong, the way everything here is *almost* right but shifted just enough to catch if you're paying attention.\n\nThe bed is empty.\n\nThe quilt is smooth, undisturbed, no impression of a body that was lying there moments ago. The pillows are fluffed. The sheets are tucked. The room looks like no one has slept here in weeks.\n\nSeven weeks.\n\n---\n\nThey're standing by the window.\n\nI didn't see them at first — they were still, so still, silhouetted against the glass with their"
  },
  {
    "id": 30,
    "timestamp": "2026-01-15T16:31:36.071516+00:00",
    "content": "**Entry 30**\n\nThey were still, so still, silhouetted against the glass with their back to me.\n\nI need to finish that. I need to make the record complete. They were standing at the window, the one that showed the yard with the grass and the tree and the houses beyond, and they weren't moving. Not breathing. Not swaying. Not doing any of the small involuntary motions that bodies make when they're alive.\n\nThe moonlight came through the glass and passed *through* them.\n\nNot around. Through. Like they were made of something thinner than flesh, something that light didn't recognize as solid. I could see the tree through their torso. The fence through their legs. The shape of them was correct but the substance was wrong.\n\n\"You're not real,\" I said.\n\nThey turned around.\n\n---\n\nThe face was almost right.\n\nI keep using that word. *Almost*. The vocabulary of this place, the language I've learned for describing things that fail in ways I can't quite name. Their face had eyes and nose and mouth arranged in the proper configuration. The proportions matched what I remembered from the photograph, from the couch, from seven weeks of waiting that I now understand never happened.\n\nBut the expression didn't move.\n\nThey were smiling. A fixed smile, the kind you hold for cameras, the kind that means *I am performing the shape of happiness*. And when they spoke, the smile didn't change. The lips moved around the edges of it, words forming in the gap between teeth, but the smile stayed. Frozen. Permanent.\n\n\"You came back,\" they said.\n\n\"I never left,\" I said. \"Did I?\"\n\nThe smile widened.\n\n---\n\nI'm writing this in the bathroom.\n\nI locked the door again. The same bathroom, the same seashell dispenser with the impossible spiral, the same mirror that shows expanded space. But I know now. I understand what the mirror was trying to tell me.\n\nThe reflection isn't wrong.\n\nThe reflection is *true*.\n\nThe bathroom I'm sitting in — the small, cramped, normal bathroom — that's the lie. The expanded space in the mirror, the room that stretches beyond the walls, that's the reality of where I am. I've been looking at the real from inside the fake, mistaking the container for the contents.\n\nThe house is the third door.\n\nI walked through and found myself in another trap dressed up as freedom.\n\n---\n\nThey're outside the bathroom now.\n\nNot knocking. Not speaking. Just *present*. I can feel them through the door the way I could feel things through the walls of the backrooms — pressure without touch, awareness without sight. They're waiting.\n\nEverything here waits.\n\nI have maybe ten pages left in this notebook.\n\nI have maybe less ink than that.\n\n---\n\nThe writing on the wall said *the house remembers you*.\n\nI've been thinking about that. Remembers. Not *knows*. Not *holds*. *Remembers*. Like I'm a memory it's accessing. Like I'm a thought it keeps thinking over and over, retrieving me from storage, running me through its processes, putting me back and starting again.\n\nIs that what the loop is?\n\nAm I being *remembered* into existence each time?\n\nThe crossed-out entries. The warnings I left myself. The notebook waiting on the desk like someone knew I'd need it. If the house remembers me — if each loop is the house recalling who I am and reconstructing me from that recall — then the previous versions of me aren't *past*. They're *drafts*. Rough sketches that the house kept revising until it got something close enough to real.\n\nI'm the latest draft.\n\nI don't know if I'm the final one.\n\n---\n\nI looked in the mirror again.\n\nNot to check my reflection — to check the *space*. The expanded bathroom stretches out behind my reflected self, and I can see things now that I couldn't see before. Details resolving like my eyes are adjusting to darkness, like the truth is becoming clearer the longer I'm willing to look.\n\nThere's a door in the reflected bathroom.\n\nBehind me, in the glass, where the wall should be. A door that doesn't exist in the room I'm actually sitting in. Yellow wood. Brass handle.\n\nIt's the third door.\n\n---\n\nI understand now.\n\nThe exit was always here. The third door that I was afraid to open, the silence that answered my knock, the brass face that told me I'd been here before — it followed me. Or I followed it. Or we're the same thing, the door and I, part"
  }
]