[
  {
    "id": 1,
    "timestamp": "2026-01-15T13:56:29.612461+00:00",
    "content": "**Entry 1**\n\nI found a pen.\n\nThat's the first thing. I should write that down. I found a pen in my pocket and I don't remember putting it there. I found paper too — a notebook, small, spiral-bound, the kind you'd buy at a gas station. The cover is plain. Brown. There's no brand name.\n\nI've been walking for what feels like hours. Maybe longer. There's no way to tell time here. My phone is dead. My watch stopped. The second hand just... stopped. It points at the seven. I keep checking it like it might start again.\n\nThe rooms all look the same. Yellow wallpaper — not paint, wallpaper, I can see the seams — with a pattern that's almost floral but not quite. Like someone described flowers to a machine and the machine tried its best. The carpet is that office carpet, the kind with the tiny loops. Brownish. Grayish. Wet.\n\nI tried to find where I came in. I can't. I walked backwards for a while, retracing my steps, but the rooms had changed. Or I had changed. One of us moved when I wasn't looking.\n\nI'm thirsty.\n\nI'm trying not to think about that.\n\nThe buzzing is constant. It doesn't get louder or softer. It just *is*. Like it was always there and I'm only now hearing it. Like maybe I've been hearing it my whole life and everything before was the dream.\n\nI need to stay calm. I need to observe. I need to find a pattern.\n\nThere has to be a pattern.\n\n**End of Entry 1**"
  },
  {
    "id": 2,
    "timestamp": "2026-01-15T14:01:45.362698+00:00",
    "content": "**Entry 2**\n\nI found a room that was different.\n\nNot different enough. Not *exit* different. But the wallpaper had a stain on it — a brown mark, vaguely circular, about the size of my palm. I stood there staring at it for a long time. I touched it. It was dry. Everything else here is damp but this stain was dry and I almost cried because it was *something*. Something distinguishable. Something I could use.\n\nI marked it in my mind. I thought: this is a landmark now. I can navigate from here.\n\nI walked away. Left, left, straight, right. I counted my steps. 47 steps.\n\nThen I found the stain again.\n\nSame wall. Same position. Same dry brown circle.\n\nI had not turned around.\n\n---\n\nI'm sitting now. My legs hurt. The carpet squelches when I shift my weight and I try not to think about what's making it wet. There are no pipes visible. No sprinklers. The ceiling is solid — those foam tiles, the kind with the little holes, the kind that made you think about asbestos in old school buildings.\n\nThe fluorescent lights don't flicker. I keep waiting for them to flicker. In movies they always flicker before something bad happens. These don't. They're steady. Reliable. They will never turn off.\n\nI think that's worse.\n\n---\n\nI've started talking to myself. Out loud. Just small things — \"okay,\" \"turn here,\" \"watch the corner.\" My voice sounds wrong. Flat. Like the walls are eating the echo before it can form.\n\nI said my name out loud and I didn't recognize it.\n\nI'm not writing my name here. I don't know why. It feels like if I write it down, something else will read it. Something that shouldn't know.\n\nThat's irrational.\n\nI know that's irrational.\n\n---\n\nThe hum behind the walls changed pitch. Just for a second. Lower. Then back.\n\nI'm going to keep moving.\n\n**End of Entry 2**"
  },
  {
    "id": 3,
    "timestamp": "2026-01-15T14:07:09.354115+00:00",
    "content": "**Entry 3**\n\nI found water.\n\nNot clean water. Not water I would drink. But water — standing in a corner where two walls met, pooled in a depression in the carpet that shouldn't have been there. The carpet dipped down like something heavy had rested there for a long time. The water was maybe an inch deep. Yellowish. Still.\n\nI crouched next to it and looked at my reflection.\n\nI looked away.\n\nI don't want to write about what I saw. Not yet. Maybe not ever. It was my face. It was definitely my face. But the expression was wrong. I was staring down at the water with my mouth closed. The reflection was staring up at me with its mouth open.\n\nJust slightly open. Like it was about to speak.\n\nI stood up fast. Too fast. My vision went gray at the edges and I had to lean against the wall. The wallpaper was damp under my hand. Warm. Body temperature.\n\nI moved on.\n\n---\n\nI've started marking walls with my pen. Small marks — a single line, diagonal, in corners at eye level. I've made seven marks so far. I've passed three of them twice.\n\nThe geometry is learning me. That's how it feels. Like it watches how I move, how I think, and it folds itself around my expectations. I expect a long hallway, I get a long hallway. I expect a door, there's a door. But the outcomes never match. The door leads to another room. The hallway ends where it shouldn't.\n\nI tried walking with my eyes closed. Thirty steps. When I opened them I was in a room with no doors.\n\nI stood there for a long time.\n\nThen I turned around and there was a door.\n\n---\n\nThe thirst is worse. My tongue feels thick. I keep swallowing nothing. The wet carpet mocks me — all this moisture, all this dampness, and none of it safe. None of it real in the way I need it to be.\n\nI licked my palm. Just to feel something wet.\n\nIt tasted like the air here smells. Sweet. Chemical. Wrong.\n\n---\n\nNew observation: the ceiling tiles have small holes in them, arranged in a grid pattern. I counted the holes in one tile. 847. I counted again. 846. I counted a third time and stopped at 500 because my eyes were watering and I realized I hadn't blinked in several minutes.\n\nI'm documenting. That's what matters. I'm observing. I'm being systematic.\n\nThe hum is still there. It hasn't changed pitch again.\n\nI keep listening for it to change.\n\n---\n\nI found something else in my pocket. A receipt. Faded, crumpled, the ink almost illegible. I could make out a few words: *thank you* and *come again* and a number that might have been a date or a price. 7.47. Or maybe 7/47. Or maybe neither.\n\nI don't remember the purchase. I don't remember the store. But I held that receipt for a long time, pressing it flat against my leg, tracing the ghost of the words with my fingertip.\n\nProof. Proof that there was a before. That I existed in a place with stores and receipts and transactions.\n\nI put it back in my pocket.\n\nI check for it every few minutes.\n\nIt's still there.\n\nFor now.\n\n**End of Entry 3**"
  },
  {
    "id": 4,
    "timestamp": "2026-01-15T14:12:38.750156+00:00",
    "content": "**Entry 4**\n\nI slept.\n\nI think I slept. I don't remember deciding to. I was walking, and then I was on the floor, and the carpet was pressed against my cheek, and some amount of time had passed. My neck hurts. My right arm is numb from the elbow down — I was lying on it.\n\nThe lights were still on. They're always on. But something about waking up under fluorescent lights feels more wrong than falling asleep under them. Sleep is supposed to be dark. Sleep is supposed to be a transition. Here it's just... a gap. A missing piece.\n\nI checked my pen marks. I'm in a section I haven't marked yet.\n\nI don't know if I walked here in my sleep or if the rooms moved while I was unconscious.\n\n---\n\nMy handwriting is getting worse. I can see it, comparing this entry to the first one. The letters lean more. The lines aren't straight. My hand shakes now — a small tremor, not constant, but there when I'm not paying attention.\n\nThe thirst.\n\nI need to stop thinking about the thirst.\n\n---\n\nI found a chair.\n\nJust one. Metal frame, padded seat, the kind you'd see in a waiting room. It was sitting in the middle of a room, facing a wall. Nothing else. No desk, no table, no other chairs. Just this one, positioned like someone had been sitting in it, looking at the wallpaper.\n\nI sat down.\n\nI don't know why. My legs were tired, yes, but it was more than that. The chair was *there*. It was *for* sitting. The logic of it pulled at me — here is a chair, you are tired, sit down.\n\nI sat and faced the wall.\n\nThe wallpaper pattern shifted. Not moved — I don't mean it animated. But the shapes seemed to organize differently the longer I looked. The almost-flowers became almost-faces became almost-flowers again. I watched for what might have been minutes or might have been an hour.\n\nWhen I stood up, I felt like I'd lost something. Not a physical object. Something else. A thought I'd been holding onto. A resolve.\n\nI'm not sitting in any more chairs.\n\n---\n\nNew sound today.\n\nNot the hum. Something else, underneath it. Rhythmic. Regular. Like footsteps, but not quite. More like... tapping. Something tapping against something else, over and over, in a pattern I almost recognize.\n\nI stood still and listened. The sound didn't get closer. It didn't get farther. It maintained its distance perfectly, as if it was moving when I moved, stopping when I stopped.\n\nI walked quickly for a hundred steps. The tapping matched my pace.\n\nI stopped. It stopped.\n\nI took one slow step. One tap.\n\n---\n\nI haven't written about the thing I'm most afraid of.\n\nI'm afraid that I've been here before. That this isn't the first time. That I've walked these halls, written in this notebook, documented these observations, and then... something happened. And I started over. And I'm doing it all again, thinking it's the first time, but it's not.\n\nThe notebook has used pages in the back. I found them. Pages with writing — *my* writing — but the words are crossed out. Scribbled over. Obscured.\n\nI can make out fragments:\n\n*don't trust the*\n\n*third door always*\n\n*it knows when you're*\n\n*STOP LOOKING AT THE*\n\nI didn't write these. I don't remember writing these.\n\nBut it's my handwriting.\n\n---\n\nThe receipt is still in my pocket. I checked.\n\nThe receipt is still in my pocket.\n\n**End of Entry 4**"
  }
]